[{"description":"A simple grilled cheese sandwich","ingredients":[{"text":"4 oz. gruyere cheese, sliced"},{"text":"4 oz. fontina cheese, sliced"},{"text":"2 oz. blue cheese, crumbled"},{"text":"3 tbsp. butter"},{"text":"2 slices of bread"}],"author":"Melissa Laughlin","cookTime":10,"steps":[{"text":"Begin by placing a pan on the stove, leaving the heat off."},{"text":"Butter the side of the bread that is going to be the outside of the sandwich, for both slices.  Place the first slice butter side down in the pan."},{"text":"Layer the cheese on the bread in the pan.  When finished, place the other piece of bread on the sandwich, butter side up, and turn on the heat.  Cook until both sides are golden brown, then eat."}],"id":"grilled_cheese","prepTime":5,"name":"Grilled Cheese"},{"description":"Courtesy of Ina Garten","author":"Ina Garten","ingredients":[{"text":"3 split chicken breasts, bone-in, skin-on"},{"text":"3 tablespoons olive oil"},{"text":"Kosher salt"},{"text":"Freshly ground black pepper"},{"text":"5 cups chicken stock, preferably homemade"},{"text":"2 chicken bouillon cubes"},{"text":"6 tablespoons (1 1/2 sticks) unsalted butter"},{"text":"2 cups yellow onions, chopped (2 onions)"},{"text":"3/4 cup all-purpose flour"},{"text":"1/4 cup heavy cream"},{"text":"2 cups medium-diced carrots, blanched for 2 minutes"},{"text":"1 (10-ounce) package frozen peas (2 cups)"},{"text":"1 1/2 cups frozen small whole onions"},{"text":"1/2 cup minced fresh parsley leaves"},{"text":"3 stalks celery"},{"text":"7 oz crimini mushrooms"},{"text":"3 cups all-purpose flour"},{"text":"1 1/2 teaspoons kosher salt"},{"text":"1 teaspoon baking powder"},{"text":"1/2 cup vegetable shortening"},{"text":"1/4 pound cold unsalted butter, diced"},{"text":"1/2 to 2/3 cup ice water"},{"text":"1 egg beaten with 1 tablespoon water, for egg wash"},{"text":"Flaked sea salt and cracked black pepper"}],"cookTime":55,"steps":[{"text":"Preheat the oven to 350 degrees F."},{"text":"Place the chicken breasts on a baking sheet and rub them with olive oil. Sprinkle generously with salt and pepper. Roast for 35 to 40 minutes, or until cooked through. Set aside until cool enough to handle, then remove the meat from the bones and discard the skin. Cut the chicken into large dice. You will have 4 to 6 cups of cubed chicken."},{"text":"In a saute pan, heat olive oil over medium heat.  Add pearl onion, salt, and pepper.  Saute until caramelized, deglazing with chicken stock if pan gets too hot.  Deglaze with marsala.  Add diced mushrooms, salt, and pepper, and saute until caramelized.  Deglaze with more marsala. In a large pot or Dutch oven, melt the butter and saute the onions, celery, and carrots (with salt and pepper) over medium-low heat for 10 to 15 minutes, until translucent. Add the flour and cook over low heat, stirring constantly, for 2 minutes. Add the hot chicken stock to the sauce. Simmer over low heat for 1 more minute, stirring, until thick. Add 2 teaspoons salt, 1/2 teaspoon pepper, and heavy cream. Add the cubed chicken, carrots, peas, onions, mushrooms and parsley. Mix well."},{"text":"For the pastry, mix the flour, salt, and baking powder in the bowl of a food processor fitted with a metal blade. Add the shortening and butter and mix quickly with your fingers until each piece is coated with flour. Pulse 10 times, or until the fat is the size of peas. With the motor running, add the ice water; process only enough to moisten the dough and have it just come together. Dump the dough out onto a floured board and knead quickly into a ball. Wrap the dough in plastic and allow it to rest in the refrigerator for 30 minutes."},{"text":"Preheat the oven to 375 degrees F."},{"text":"Divide the filling equally among 4 ovenproof bowls. Divide the dough into quarters and roll each piece into an 8-inch circle. Brush the outside edges of each bowl with the egg wash, then place the dough on top. Trim the circle to 1/2-inch larger than the top of the bowl. Crimp the dough to fold over the side, pressing it to make it stick. Brush the dough with egg wash and make 3 slits in the top. Sprinkle with sea salt and cracked pepper. Place on a baking sheet and bake for 1 hour, or until the top is golden brown and the filling is bubbling hot."}],"id":"chicken_pot_pie","prepTime":30,"name":"Chicken Pot Pie"},{"description":"An easy-to-make, no cook hollandaise.","ingredients":[{"text":"1 to 1 1/2 sticks butter"},{"text":"2 egg yolks"},{"text":"1 teaspoon water"},{"text":"1 teaspoon lemon juice"},{"text":"Salt and pepper to taste"}],"author":"Food Network","cookTime":0,"steps":[{"text":"In a blender blend yolks, water and lemon juice until smooth. Add melted butter by droplets until sauce begins to emulsify. Then continue slowly adding hot butter by spoonfuls. Strain sauce and season."},{"text":"Serve over poached eggs on toast points"}],"servings":"4","id":"blender_hollandaise_sauce","prepTime":5,"name":"Blender Hollandaise Sauce"},{"description":"Courtesy of Melissa Laughlin","ingredients":[{"text":"1/2 to 3/4 cup mayonaisse"},{"text":"1 dill pickle spear, minced"},{"text":"1 tsp hot sauce"},{"text":"1/2 tsp Worchestershire sauce"},{"text":"1 tsp Amish mustard"},{"text":"Salt and pepper to taste"}],"author":"Melissa Laughlin","cookTime":0,"steps":[{"text":"Combine all ingredients in a container, and chill.  The longer it sits, the better it gets."}],"id":"tartar_sauce","prepTime":10,"name":"Tartar Sauce"},{"name":"Broccoli Soup","author":"Michele Laughlin","ingredients":[{"text":"1 medium onion, diced"},{"text":"1 lb broccoli crowns, chopped"},{"text":"1 carrot, chopped"},{"text":"1 tablespoon olive oil"},{"text":"4 cups chicken broth"},{"text":"2 tbps fat-free half & half"},{"text":"1 tablespoon butter"},{"text":"1 tsp salt"},{"text":"Pinch of red pepper flakes"},{"text":"Pinch of celery salt"},{"text":"Salt and pepper to taste"}],"steps":[{"text":"Note: this recipe was typed from an email, so the amounts are not exact."},{"text":"In a large soup pot, combine olive oil and butter, and bring up to a medium heat.  Saute onions, red pepper flakes, and celery salt. After a couple of minutes, add in the carrot and cook together for about 5 minutes."},{"text":"Add the broccoli to the pot, along with the salt, and cook for 5 minutes.  Add in enough chicken broth to just barely cover the vegetables.  Stir, and bring to a boil, then reduce to a simmer.  Cook until the broccoli is tender (about 5 to 10 minutes)"},{"text":"Use a stick blender and blend until soup is smooth.  Add in the half & half, and stiir until combined.  Add salt and pepper to taste."}],"id":"broccoli_soup","prepTime":40,"description":"Courtesy of Michele Laughlin"},{"description":"Courtesy of Emeril Lagasse & Melissa Laughlin","ingredients":[{"text":"1 pound dried split peas"},{"text":"1 ham bone"},{"text":"3 tablespoons extra virgin olive oil"},{"text":"1 cup finely chopped yellow onions"},{"text":"1/2 cup finely chopped celery"},{"text":"1/2 cup finely chopped carrots"},{"text":"2 teaspoons minced garlic"},{"text":"1 pound Smithfield ham, chopped"},{"text":"3/4 teaspoon freshly ground black pepper"},{"text":"1/4 teaspoon crushed red pepper flakes"},{"text":"6 cups water"},{"text":"2 cups chicken stock"},{"text":"1 bay leaf"},{"text":"2 teaspoons fresh thyme"}],"author":"Emeril Lagasse","cookTime":80,"steps":[{"text":"Place the peas in a large pot or bowl, cover with water by 2 inches and soak 3 1/2 hours or overnight. Drain the peas and set aside."},{"text":"In a large pot, melt the butter over medium-high heat. Add the onions and cook, stirring, for 2 minutes. Add the celery and carrots and cook, stirring, until just soft, about 3 minutes. Add the garlic and cook, stirring, for 30 seconds."},{"text":"Add the ham hock and ham and cook, stirring, until beginning to brown. Add the drained peas, salt, pepper, and pepper flakes, and cook, stirring for 2 minutes. Add 6 cups of water and 2 cups of chicken stock, the bay leaf and thyme, and cook, stirring occasionally, until the peas are tender, about 2 hours. (Add more water as needed, if the soup becomes too thick or dry.)"},{"text":"Remove the bay leaf and discard. Adjust the seasoning, to taste, and serve immediately."}],"id":"ham_and_split_pea_soup","prepTime":20,"name":"Ham and Split Pea Soup"},{"description":"Courtesy of Paula Deen & Melissa Laughlin","ingredients":[{"text":"1/2 bell pepper, chopped"},{"text":"1 green onion, chopped"},{"text":"1/2 large carrot, chopped"},{"text":"1/8 cup chopped fresh parsley leaves"},{"text":"1/2 cabbage head"},{"text":"3/4 cup mayonnaise"},{"text":"1 teaspoon seasoning salt"},{"text":"1/4 teaspoon coarsely ground black pepper"},{"text":"3 to 4 tablespoons sugar"},{"text":"1/2 teaspoon lemon-pepper seasoning"},{"text":"2 tablespoon white vinegar"}],"author":"Paula Deen","cookTime":60,"steps":[{"text":"Using a food processor, gently process the bell pepper, onion, carrot, and parsley, being careful not to over process. Cut 1/2 of the cabbage into chunks and place in the food processor and process lightly, making sure the cabbage doesn't become mushy. Slice the remaining cabbage thinly. Mix the cabbage together with the processed vegetables. In a separate bowl, mix the remaining ingredients together and allow to stand for a few minutes. Combine the mayonnaise mixture with the vegetables and toss. Chill for 1 hour."}],"id":"the_ladys_coleslaw","prepTime":30,"name":"The Lady's Coleslaw"},{"description":"Pretty close to the shrimp truck on Oahu","ingredients":[{"text":"10 16-20 count shrimp, shell on & deveined"},{"text":"1 head garlic, chopped"},{"text":"1 cup flour"},{"text":"2 tablespoons paprika"},{"text":"1/2 tablespoon cayenne"},{"text":"1/2 cup clarified butter"},{"text":"1 to 2 teaspoons salt"},{"text":"1/8 cup white wine"},{"text":"2 tablespoons butter"}],"author":"Giovanni","cookTime":10,"steps":[{"text":"Mix flour and spices.  Dredge shrimp in mixture.  Heat up the clarified butter in a pan.  Cook the garlic in the butter for 30 seconds, then add the shrimp, and cook 3 minutes per side.  Add wine, remaining butter, and salt.  Serve with sticky rice."}],"id":"giovannis_garlic_shrimp","prepTime":20,"name":"Giovanni's Garlic Shrimp"},{"description":"The only way to make bacon.","ingredients":[],"author":"Melissa Laughlin","cookTime":35,"steps":[{"text":"Place the bacon on a baking sheet, in a single layer."},{"text":"Cook the bacon for 15 minutes at 270 degrees, then flip."},{"text":"Cook the bacon for 15 mintes at 300 degrees, then flip again."},{"text":"Finally, cook the bacon for 5 minutes at 400 degrees (or as long as it takes to get it perfect)."}],"servings":4,"inactiveTime":0,"id":"topnotch_bacon","prepTime":0,"name":"Top-notch Bacon"},{"description":"Based on Chipotle's rice","author":"Melissa","ingredients":[{"text":"2 cups basmati rice"},{"text":"3 cups water"},{"text":"2 limes, juiced"},{"text":"4 tablespoons cilantro"},{"text":"1 teaspoon salt"},{"text":"2 tablespoons olive oil"}],"cookTime":17,"steps":[{"text":"Thoroughly rinse the rice, then add to a pot with the olive oil, and saute for a couple minutes."},{"text":"Add the lime juice, water and salt, and bring to a boil.  Reduce to a simmer, cover, and cook for 15 minutes."},{"text":"Turn off head and let sit covered for 30 minutes.  Add cilantro and salt to taste."}],"servings":6,"inactiveTime":30,"id":"cilantro_lime_rice","prepTime":3,"name":"Cilantro Lime Rice"},{"name":"Chocolate Salted Caramel Cupcakes","ingredients":[{"text":"½ cup plus 1 tablespoon Dutch-process cocoa powder"},{"text":"½ cup plus 1 tablespoon hot water"},{"text":"2¼ cups all-purpose flour"},{"text":"¾ teaspoon baking soda"},{"text":"¾ teaspoon baking powder"},{"text":"½ teaspoon salt"},{"text":"1 cup plus 1 tablespoon unsalted butter, at room temperature"},{"text":"1 & 2/3 cups granulated sugar"},{"text":"3 eggs"},{"text":"1 tablespoon vanilla extract"},{"text":"¾ cup sour cream"},{"text":"1 cup unsalted butter, at room temperature"},{"text":"8 ounces cream cheese, at room temperature"},{"text":"½ cup salted caramel sauce"},{"text":"4 cups powdered sugar"},{"text":"Salted Caramel Sauce"},{"text":"Fleur de Sel (or other flaky sea salt)"}],"author":"browneyedbaker.com","cookTime":20,"steps":[{"text":"Make the Cupcakes: Preheat oven to 350 degrees F. Line standard-size muffin pans with paper liners."},{"text":"In a small bowl, whisk together the cocoa powder and hot water until smooth. In a separate medium bowl, whisk together the flour, baking soda, baking powder, and salt."},{"text":"Combine the butter and sugar in a medium saucepan set over medium heat. Cook, stirring occasionally, until the mixture is smooth, and the butter is completely melted. Transfer the mixture to the bowl of an electric mixer and beat on medium-low speed until the mixture is cool, about 4 to 5 minutes."},{"text":"Add the eggs one at a time, mixing well after each addition, and scraping down the sides of the bowl as needed. Add the vanilla and then the cocoa mixture, beating until smooth."},{"text":"Reduce the mixer speed to low, and add the flour mixture in three additions, alternating with the sour cream, beginning and ending with the flour mixture. Mix each addition until just incorporated."},{"text":"Divide the batter evenly between the prepared liners, filling each about two-thirds full. Bake until a toothpick inserted in the center comes out clean, 18 to 20 minutes, rotating the pans halfway through baking. Let cool in the pan for 10 minutes, then transfer to a wire rack to cool completely."},{"text":"Beat together the butter and cream cheese on medium-high speed for 5 minutes (I like to use the whisk attachment for my KitchenAid stand mixer, but it's not necessary). Pour in the salted caramel and beat until combined. Reduce the speed to medium-low and slowly add the powdered sugar, a little at a time, until it has all been incorporated. Increase the speed to medium-high and beat for an additional two to three minutes, until light and fluffy."},{"text":"To finish, pipe frosting onto the top of each cupcake (or use an offset spatula to spread the frosting), drizzle with some additional salted caramel sauce, and sprinkle with a pinch of fleur de sel. (Note: I used an Ateco #864 decorating tip to frost these cupcakes.)"}],"servings":24,"id":"chocolate_salted_caramel_cupcakes","prepTime":30,"description":"http://www.browneyedbaker.com/salted-caramel-cupcakes-recipe/"},{"name":"Thousand Island Dressing","author":"Food Network Kitchen","ingredients":[{"text":"1/2 clove garlic, grated"},{"text":"3/4 cup prepared or homemade mayonnaise"},{"text":"2 tablespoons bottled chili sauce"},{"text":"1 tablespoon ketchup"},{"text":"1 1/2 tablespoons grated onion"},{"text":"2 teaspoons sweet pickle relish"},{"text":"1/2 hard-cooked large egg, pushed through a sieve or finely chopped"},{"text":"Freshly ground black pepper"}],"steps":[{"text":"In a small mixing bowl, whisk together the garlic, mayonnaise, chili sauce, ketchup, onion, relish and egg until combined. Season with salt and pepper to taste. Use now or store covered in the refrigerator for up to 2 days."}],"id":"thousand_island_dressing","prepTime":20},{"description":"http://southern.food.com/recipe/south-carolina-mustard-bbq-sauce-311369","ingredients":[{"text":"3/4 cup yellow mustard"},{"text":"3/4 cup cider vinegar"},{"text":"1 tablespoon light brown sugar"},{"text":"1 1/2 tablespoons unsalted butter"},{"text":"2 teaspoons salt"},{"text":"2 tablespoons Worcestershire sauce"},{"text":"1 1/4 teaspoons fresh ground black pepper"},{"text":"2 teaspoons louisiana hot sauce (to taste)"}],"author":"Food.com","cookTime":30,"steps":[{"text":"Combine all ingredients in small saucepan. Whisk to combine and occasionally while simmering for 20-30 minutes."},{"text":"Let cool before using."},{"text":"Save remainder in a sealed container in the refer. (I used a washed and rinsed out glass soy sauce bottle)."}],"id":"south_carolina_mustard_bbq_sauce","prepTime":5,"name":"South Carolina Mustard BBQ Sauce"},{"description":"http://www.browneyedbaker.com/homemade-salted-caramel-sauce-recipe/","ingredients":[{"text":"2 cups granulated sugar"},{"text":"12 tablespoons unsalted butter, at room temperature, cut into pieces"},{"text":"1 cup heavy cream, at room temperature"},{"text":"2 teaspoons fleur de sel (or any other flaky sea salt)"}],"author":"browneyedbaker.com","cookTime":15,"steps":[{"text":"Add the sugar in an even layer over the bottom of a heavy saucepan, with a capacity of at least 2 or 3 quarts. Heat the sugar over medium-high heat, whisking it as it begins to melt. You'll see that the sugar will begin to form clumps, but that's okay. Just keep whisking and as it continues to cook, they will melt back down."},{"text":"Stop whisking once all of the sugar has melted, and swirl the pan occasionally while the sugar cooks."},{"text":"Continue cooking until the sugar has reached a deep amber color. It should look almost a reddish-brown, and have a slight toasted aroma. This is the point where caramel can go from perfect to burnt in a matter of seconds, so keep a close eye. If you are using an instant-read thermometer, cook the sugar until it reaches 350 degrees F."},{"text":"As soon as the caramel reaches 350 degrees, add the butter all at once. Be careful, as the caramel will bubble up when the butter is added. Whisk the butter into the caramel until it is completely melted."},{"text":"Remove the pan from the heat and slowly pour the cream into the caramel. Again, be careful because the mixture will once again bubble up ferociously."},{"text":"Whisk until all of the cream has been incorporated and you have a smooth sauce. Add the fleur de sel and whisk to incorporate."},{"text":" Set the sauce aside to cool for 10 to 15 minutes and then pour into your favorite glass jar and let cool to room temperature. You can refrigerate the sauce for up to 2 weeks. You'll want to warm the sauce up before using."}],"servings":"2 cups","id":"salted_caramel_sauce","prepTime":5,"name":"Salted Caramel Sauce"},{"name":"Sugar Coated Pecans","ingredients":[{"text":"1 egg white"},{"text":"1 tablespoon water"},{"text":"1 pound pecan halves"},{"text":"1 cup white sugar"},{"text":"3/4 teaspoon salt"},{"text":"1/2 teaspoon ground cinnamon"}],"author":"Carolyn","cookTime":60,"steps":[{"text":"Preheat oven to 250 degrees F (120 degrees C). Grease one baking sheet."},{"text":"In a mixing bowl, whip together the egg white and water until frothy. In a separate bowl, mix together sugar, salt, and cinnamon."},{"text":"Add pecans to egg whites, stir to coat the nuts evenly. Remove the nuts, and toss them in the sugar mixture until coated. Spread the nuts out on the prepared baking sheet."},{"text":"Bake at 250 degrees F (120 degrees C) for 1 hour. Stir every 15 minutes."}],"servings":1,"id":"sugar_coated_pecans"},{"description":"Awesome mai tais","author":"hawaiiforvisitors.com","ingredients":[{"text":"1 ounce Dark Rum"},{"text":"1 oz Light Rum"},{"text":"1 oz Orange Curacao"},{"text":"2 oz Orange Juice"},{"text":"1/2 oz Lime Juice"},{"text":"Dash Orgeat"},{"text":"Dash Simple Bar Syrup "}],"steps":[{"text":"Mix all ingredients and pour over crushed or shaved ice in a glass. Service with a swizzle stick and garnish with a cherry and a slice of pineapple. on a toothpick. "}],"id":"royal_hawaiian_mai_tai","prepTime":2,"name":"Royal Hawaiian Mai Tai"},{"name":"Fluffy Peanut Butter Frosting","author":"allrecipes.com","ingredients":[{"text":"1/2 cup butter, softened"},{"text":"1 cup creamy peanut butter"},{"text":"3 tablespoons milk, or as needed"},{"text":"2 cups confectioners' sugar"}],"steps":[{"text":"Place the butter and peanut butter into a medium bowl, and beat with an electric mixer."},{"text":"Gradualy mix in the sugar, and when it starts to get thick, incorporate milk one tablespoon at a time until all of the sugar is mixed in and the frosting is thick and spreadable."},{"text":"Beat for at least 3 minutes for it to get good and fluffy."}],"servings":16,"id":"fluffy_peanut_butter_frosting","prepTime":10},{"description":"http://www.foodandwine.com/recipes/chocolate-cupcakes","author":"Grace Parisi","ingredients":[{"text":"4 tablespoons unsalted butter"},{"text":"1/4 cup vegetable oil"},{"text":"1/2 cup water"},{"text":"1 cup all-purpose flour"},{"text":"1 cup granulated sugar"},{"text":"1/4 cup plus 2 tablespoons unsweetened cocoa powder (not Dutch process)"},{"text":"3/4 teaspoon baking soda"},{"text":"1/8 teaspoon salt"},{"text":"1 large egg"},{"text":"1/4 cup buttermilk"},{"text":"1 teaspoon pure vanilla extract"}],"cookTime":25,"steps":[{"text":"Preheat the oven to 350°. Line a 12-cup muffin tin with paper or foil liners."},{"text":"In a medium saucepan, melt the butter with the vegetable oil and water over low heat."},{"text":"In a large bowl, sift the flour with the sugar, cocoa powder, baking soda and salt. Add the melted butter mixture and beat with a handheld mixer at low speed until smooth. Add the egg and beat until incorporated, then add the buttermilk and vanilla and beat until smooth, scraping the bottom and side of the bowl. Pour the batter into the lined muffin tins, filling them about three-fourths full."},{"text":"Bake the cupcakes in the center of the oven for about 25 minutes, until springy and a toothpick inserted in the center comes out clean. Let the cupcakes cool slightly, then transfer them to a rack to cool completely. Frost and top the cupcakes as desired."}],"servings":12,"id":"chocolate_cupcakes","prepTime":20,"name":"Chocolate Cupcakes"},{"name":"Pumpkin Cheesecake","author":"Paula Deen","ingredients":[{"text":"1 3/4 cups graham cracker crumbs"},{"text":"3 tablespoons light brown sugar"},{"text":"1/2 teaspoon ground cinnamon"},{"text":"1 stick melted salted butter"},{"text":"3 (8-ounce) packages cream cheese, at room temperature"},{"text":"1 (15-ounce) can pureed pumpkin"},{"text":"3 eggs plus 1 egg yolk"},{"text":"1/4 cup sour cream"},{"text":"1 1/2 cups sugar"},{"text":"1/2 teaspoon ground cinnamon"},{"text":"1/8 teaspoon fresh ground nutmeg"},{"text":"1/8 teaspoon ground cloves"},{"text":"2 tablespoon all-purpose flour"},{"text":"1 teaspoon vanilla extract"}],"cookTime":1,"inactiveTime":275,"servings":8,"steps":[{"text":"Preheat oven to 350 degrees F."},{"text":"In medium bowl, combine crumbs, sugar and cinnamon. Add melted butter. Press down flat into a 9-inch springform pan. Set aside."},{"text":"Beat cream cheese until smooth. Add pumpkin puree, eggs, egg yolk, sour cream, sugar and the spices. Add flour and vanilla. Beat together until well combined."},{"text":"Pour into crust. Spread out evenly and place in oven for 1 hour. Remove from the oven and let sit for 15 minutes. Cover with plastic wrap and refrigerate for 4 hours."}],"id":"pumpkin_cheesecake","prepTime":15},{"name":"Chicken Parmesan Burger","author":"Cooking Light","ingredients":[{"text":" 2 (3-ounce) square ciabatta rolls"},{"text":"1 garlic clove, halved"},{"text":"1/2 pound ground chicken"},{"text":"1/3 cup plus 2 tablespoons lower-sodium marinara sauce, divided"},{"text":"1/2 teaspoon chopped fresh rosemary"},{"text":"1/2 teaspoon chopped fresh thyme"},{"text":"1/4 teaspoon crushed red pepper"},{"text":"1/8 teaspoon kosher salt"},{"text":"1/8 teaspoon black pepper"},{"text":"1/4 cup shredded part-skim mozzarella cheese, divided"},{"text":"8 basil leaves"}],"cookTime":20,"steps":[{"text":"Preheat broiler."},{"text":"Cut rolls in half. Place bread, cut side up, on a baking sheet. Broil for 3 minutes or until lightly browned. Remove bread from pan. Rub each slice with cut side of garlic. Set aside."},{"text":"Preheat oven to 375°."},{"text":"Combine chicken, 1/3 cup marinara, rosemary, thyme, minced garlic, red pepper, salt, and black pepper. Divide into 2 portions, shaping each into a 1/4-inch-thick patty. Heat an ovenproof skillet over medium-high heat. Coat pan with cooking spray. Add patties to pan; cook for 3 minutes. Turn patties, and place pan in oven. Bake at 375° for 8 minutes. Top each patty with 2 tablespoons cheese; bake 1 minute."},{"text":"Layer bottom half of each roll with 2 basil leaves, 1 patty, 1 tablespoon marinara, 2 basil leaves, and roll top."}],"servings":2,"id":"chicken_parmesan_burger","prepTime":10},{"name":"The Lady's Chicken Noodle Soup","author":"Paula Deen","ingredients":[{"text":"1 (2 1/2 to 3-pound) fryer chicken, cut up"},{"text":"3 1/2 quarts water"},{"text":"1 onion, peeled and diced"},{"text":"1 1/2 to 2 teaspoons Italian seasoning"},{"text":"1 teaspoon lemon-pepper seasoning"},{"text":"3 cloves garlic, minced"},{"text":"2 bay leaves"},{"text":"3 chicken bouillon cubes"},{"text":"Kosher salt"},{"text":"2 cups sliced carrots"},{"text":"2 cups sliced celery, with leafy green tops"},{"text":"2 1/2 cups uncooked egg noodles"},{"text":"3 tablespoons chopped fresh parsley leaves"},{"text":"1/3 cup cooking sherry"},{"text":"1 teaspoon chopped fresh rosemary leaves"},{"text":"1 cup grated Parmesan, optional"},{"text":"3/4 cup heavy cream, optional"},{"text":"Seasoning salt"},{"text":"Freshly ground black pepper"},{"text":"Crusty French bread, for serving"}],"cookTime":60,"inactiveTime":0,"servings":10,"steps":[{"text":"For the stock: add all ingredients to a soup pot. Cook until chicken is tender, about 35 to 45 minutes. Remove chicken from pot and set aside to cool. Remove and discard bay leaves and onion. You should have approximately 3 quarts of stock. When chicken is cool enough to touch, pick bones clean, discarding bones, skin, and cartilage. Set chicken aside."},{"text":"For the soup: bring stock back to a boil, add carrots, and cook for 3 minutes. Add celery and continue to cook for 5 to 10 minutes. Add egg noodles and cook according to directions on package. When noodles are done, add chicken, mushrooms, parsley, sherry and rosemary. Add Parmesan and cream, if using. Cook for another 2 minutes. Adjust seasoning, if needed, by adding seasoning salt and pepper. Enjoy along with a nice hot crusty loaf of French bread."}],"id":"the_ladys_chicken_noodle_soup","prepTime":25},{"name":"Black Bean Burger","author":"Cooking Light","ingredients":[{"text":"1 (2-ounce) hamburger bun, torn into pieces"},{"text":"3 tablespoons olive oil, divided"},{"text":"2 teaspoons chopped garlic"},{"text":"1 (15.25-ounce) can black beans, rinsed and drained"},{"text":"1 teaspoon grated lime rind"},{"text":"3/4 teaspoon chili powder"},{"text":"1/2 teaspoon chopped fresh oregano"},{"text":"1/4 teaspoon salt"},{"text":"1 large egg, lightly beaten"},{"text":"1 large egg white, lightly beaten"}],"cookTime":10,"steps":[{"text":"Place bun in a food processor; process 4 times or until crumbs measure about 1 cup. Transfer to a bowl."},{"text":"Combine 1 tablespoon oil, garlic, and beans in processor; pulse 8 times or until beans make a thick paste. Scrape bean mixture into bowl with breadcrumbs. Stir in rind and remaining ingredients. With moistened hands, divide bean mixture into 4 equal portions (about 1/3 cup mixture per portion), shaping each into a 3-inch patty."},{"text":"Heat remaining 2 tablespoons oil in a large nonstick skillet over medium-high heat. Add patties to pan; reduce heat to medium, and cook 4 minutes or until bottom edges are browned. Carefully turn patties over; cook 3 minutes or until bottom edges are done."}],"servings":4,"id":"black_bean_burger","options":{"isDairyFree":true,"isVegan":false,"isCrockPot":false,"isVegetarian":true,"isGlutenFree":false},"prepTime":10},{"name":"Teriyaki Sauce","author":"Food Network","ingredients":[{"text":"1/2 cup soy sauce"},{"text":"1/4 cup water"},{"text":"2 tablespoons sweet rice wine"},{"text":"1 tablespoon, plus 2 teaspoons brown sugar"},{"text":"1/4 cup sugar"},{"text":"1 1/2 teaspoons minced garlic"},{"text":"1 1/2 teaspoons minced ginger"},{"text":"1/2 tablespoon cornstarch"},{"text":"1 tablespoon water"}],"cookTime":5,"steps":[{"text":"Combine all ingredients except cornstarch and 1 tablespoon water in a saucepan on medium heat until the sugar is dissolved."},{"text":"To make glaze: Mix 1/2 tablespoon cornstarch with 1 tablespoon water. Heat sauce on medium high heat and add cornstarch water mixture. Simmer until thickened."}],"id":"teriyaki_sauce","prepTime":5},{"name":"Crustless Spinach Cheese Quiche","author":"Paula Deen","ingredients":[{"text":"Cooking spray"},{"text":"1 (10 ounce) package frozen chopped spinach"},{"text":"4 eggs"},{"text":"1 cup sour cream"},{"text":"1 cup small curd cottage cheese"},{"text":"1/2 cup grated Parmesan"},{"text":"1/4 cup unbleached all-purpose flour"},{"text":"1 teaspoon salt"},{"text":"1/4 teaspoon freshly ground black pepper"},{"text":"2 cups grated Cheddar"}],"cookTime":45,"steps":[{"text":"Preheat the oven to 325 degrees F. Spray an 8 by 8-inch baking dish with cooking spray."},{"text":"Unwrap the spinach and put it, box and all, on a plate. Microwave and cook on high power for 4 minutes. Allow it to cool and remove it from the box. Squeeze out all of the liquid out of the spinach and put it into a medium bowl."},{"text":"Combine the eggs, sour cream, cottage cheese, Parmesan, flour, salt, and pepper, in a medium bowl. Stir together, or blend in food processor until the mixture is smooth, about 1 minute. Pour the mixture into the bowl with the spinach. Add the Cheddar and blend with a spoon until well mixed. Pour the spinach mixture into the baking dish and smooth out the top."},{"text":"Bake until set, about 45 minutes. Remove the baking dish from the oven. It will be puffed up, but will fall slightly as it cools. Allow it to cool, then, refrigerate. Cut it into squares and serve."}],"servings":8,"id":"crustless_spinach_cheese_quiche","prepTime":10},{"name":"Rib Eye Steak Panini","author":"Giada De Laurentiis","ingredients":[{"text":"1 tablespoon extra-virgin olive oil"},{"text":"2 cloves garlic, minced"},{"text":"1 small onion, thinly sliced"},{"text":"1 small red bell pepper, cored, seeded and thinly sliced"},{"text":"1 teaspoon herbes de Provence"},{"text":"1/2 teaspoon kosher salt"},{"text":"1/4 teaspoon freshly ground black pepper"},{"text":"1 tablespoon extra-virgin olive oil"},{"text":"One 1-pound boneless rib eye steak, cut into 1/4-inch-thick slices"},{"text":"3/4 teaspoon kosher salt"},{"text":"1/4 teaspoon freshly ground black pepper"},{"text":"1/2 cup jarred tomato-basil sauce, such as Giada De Laurentiis for Target"},{"text":"4 kaiser rolls, halved"},{"text":"1 1/3 cups arugula"},{"text":"4 slices sharp provolone"}],"cookTime":20,"steps":[{"text":"For the vegetables: In a large nonstick skillet, heat the oil over medium-high heat. Add the garlic, onions, peppers, herbes de Provence, salt and pepper. Cook, stirring occasionally, until the vegetables are soft, 8 to 10 minutes. Remove the vegetables and set aside."},{"text":"For the steak: In the same skillet, heat the oil over high heat. Add the steak and sprinkle with the salt and pepper. Cook, stirring constantly, until the steak is cooked through to desired doneness, 2 to 3 minutes."},{"text":"For the panini: Spoon 2 tablespoons of marinara sauce onto the bottom of each roll. Add the arugula and top with the cooked vegetables. Arrange the steak on the vegetables and place a slice of cheese on top. Place the tops on the rolls and cook in a panini maker until the cheese has melted, about 5 minutes."}],"servings":4,"id":"rib_eye_steak_panini","prepTime":10},{"description":"Also known as carmelized onion deliciousness","author":"Ina Garten","ingredients":[{"text":"2 large yellow onions\r"},{"text":"4 tablespoons unsalted butter\r"},{"text":"1/4 cup vegetable oil\r"},{"text":"1/4 teaspoon ground cayenne pepper\r"},{"text":"1 teaspoon kosher salt\r"},{"text":"1/2 teaspoon freshly ground black pepper\r"},{"text":"4 ounces cream cheese, at room temperature\r"},{"text":"1/2 cup sour cream\r"},{"text":"1/2 cup good mayonnaise\r"}],"cookTime":30,"steps":[{"text":"Cut the onions in half and then slice them into 1/8-inch thick half-rounds. (You will have about 3 cups of onions.) Heat the butter and oil in a large saute pan over medium heat. Add the onions, cayenne, salt, and pepper and saute for 10 minutes. Reduce the heat to medium-low and cook, stirring occasionally, for 20 more minutes until the onions are browned and caramelized. Allow the onions to cool.\r"},{"text":"Place the cream cheese, sour cream and mayonnaise in the bowl of an electric mixer fitted with the paddle attachment and beat until smooth. Add the onions and mix well. Taste for seasonings. Serve at room temperature.\r"}],"servings":2,"inactiveTime":30,"id":"panfried_onion_dip","prepTime":10,"name":"Pan-Fried Onion Dip"},{"description":"An excellent substitute for alfredo, and works with any type of pasta","author":"Melissa Laughlin","ingredients":[{"text":"1/2 lb linguine"},{"text":"1/2 head of garlic, minced"},{"text":"1 cup of reserved pasta cooking liquid"},{"text":"2 oz mascarpone"},{"text":"1/2 parmiggiano reggiano, shredded"},{"text":"2 tbsp parsely, chopped"},{"text":"salt and pepper to taste"}],"cookTime":15,"steps":[{"text":"Cook pasta until al dente, in salted water.  When done, reserve at least a cup of cooking liquid.  Drain pasta."},{"text":"Add olive oil, garlic, and salt to pan, and cook for one minute."},{"text":"Add cooking liquid, followed by mascarpone.  Add in the parmiggiano, along with a liberal amount of pepper."},{"text":"Add pasta and parsely, and stir to coat.  Add more cooking liquid as needed to create a creamy sauce.  Adjust seasoning as needed."}],"servings":2,"id":"creamy_garlic_linguine","prepTime":5,"name":"Creamy Garlic Linguine"},{"name":"Broccoli Salad","ingredients":[{"text":"2 lbs broccoli"},{"text":"6 to 8 slices cooked bacon, crumbled\r"},{"text":"1/2 cup chopped red onion, rinsed"},{"text":"1/2 cup craisins"},{"text":"8 ounces sharp Cheddar, shredded"},{"text":"1 cup mayonnaise\r"},{"text":"2 tablespoons white vinegar\r"},{"text":"2 tablespoons sugar"},{"text":"1 pint halved cherry tomatoes"},{"text":"Salt and freshly ground black pepper\r"}],"author":"Paula Deen","steps":[{"text":"Trim off the large leaves from the broccoli stem. Remove the tough stalk at the end and wash broccoli head thoroughly. Cut the head into flowerets and the stem into bite-size pieces."},{"text":"Place in a large bowl. Add the crumbled bacon, onion, raisins if using, and cheese. In a small bowl, combine the remaining ingredients, stirring well. Add to broccoli mixture and toss gently."}],"servings":8,"id":"broccoli_salad","prepTime":15},{"name":"Snickerdoodles","ingredients":[{"text":"2 3/4 cups all-purpose flour"},{"text":"1 teaspoon baking soda"},{"text":"1/2 teaspoon fine salt"},{"text":"1/2 cup shortening"},{"text":"8 tablespoons (1 stick) unsalted butter, softened"},{"text":"1 1/2 cups sugar, plus 3 tablespoons"},{"text":"2 large eggs"},{"text":"1 tablespoon ground cinnamon"},{"text":"1 teaspoon vanilla"},{"text":"1 teaspoon cream of tartar"}],"author":"Emeril Lagasse","cookTime":12,"steps":[{"text":"Preheat the oven to 350 degrees F."},{"text":"Sift the flour, baking soda, and salt into a bowl."},{"text":"With a handheld or standing mixer, beat together the shortening and butter. Add the 1 1/2 cups sugar and continue beating until light and fluffy, about 5 minutes. Add the eggs, 1 at a time, beating well after each addition. Add the flour mixture and blend until smooth."},{"text":"Mix the together cinnamon and sugar to taste in a small bowl. Roll the dough, by hand, into 1 1/2-inch balls. Roll the balls in the cinnamon sugar. Space the cookies evenly on unlined cookie sheets. Bake until light brown, but still moist in the center, 12 1/2 minutes. Cool on a rack."}],"servings":20,"id":"snickerdoodles","prepTime":25},{"name":"Hand-Formed Parmesan Tater Tots","ingredients":[{"text":"3 large red potatoes (1 1/2 pounds)"},{"text":"2 cloves of roasted garlic"},{"text":"1/2 cup shredded Parmesan cheese"},{"text":"1 dash freshly ground sea salt"},{"text":"Olive oil for greasing pan"},{"text":"cheddar cheese (optional)"}],"author":"CamillaMMann","cookTime":80,"steps":[{"text":"Preheat oven to 400° F."},{"text":"Scrub the potatoes clean and roast until they are fork tender. Cool them rapidly by plunging them in ice water. Change the water, and repeat, until the potatoes are cool."},{"text":"Shred the potatoes on the large holes of a box grater. You can peel them first."},{"text":"Place the other ingredients into the bowl with the grated potatoes and use a fork to fully combine everything."},{"text":"Line a baking sheet with parchment paper and rub it with a layer of olive oil, or place on a Silpat."},{"text":"Preheat oven to 425° F."},{"text":"Using about a teaspoon of the potato mixture, form it into a cylinder about 1 inch long. Place on baking sheet and repeat until all the tots are made."},{"text":"Bake about 35 to 40 minutes, turning once about 20 minutes into the cooking time. Serve hot with ketchup."},{"text":"Note: instead of using the potatoes, you can use one bag of Trader Joe's Hash Browns"}],"servings":4,"id":"handformed_parmesan_tater_tots","prepTime":15},{"name":"Pecan Pie Monkey Bread","ingredients":[{"text":"Dough:\r"},{"text":"1 package (1/4 ounce) active dry yeast\r"},{"text":"1/4 cup water (110 degrees F to 115 degrees F)\r"},{"text":"5 cups all-purpose flour, plus more for dusting\r"},{"text":"1 cup warm 2-percent milk (110 degrees F to 115 degrees F)\r"},{"text":"1/3 cup unsalted butter, melted, plus more for greasing\r"},{"text":"1/4 cup sugar\r"},{"text":"1 teaspoon salt\r"},{"text":"2 eggs\r"},{"text":"Caramel:\r"},{"text":"6 tablespoons unsalted butter, cubed, plus more for greasing\r"},{"text":"1 cup packed brown sugar\r"},{"text":"6 tablespoons heavy whipping cream\r"},{"text":"6 tablespoons chopped pecans\r"},{"text":"Assembly:\r"},{"text":"1 cup sugar\r"},{"text":"2 teaspoon ground cinnamon"},{"text":"1/2 cup unsalted butter, melted\r"},{"text":"6 tablespoons chopped pecans\r"}],"author":"Bobby Flay","cookTime":55,"inactiveTime":765,"servings":20,"steps":[{"text":"For the dough: Dissolve the yeast in the water in the bowl of a stand mixer. Add 3 cups of the flour, the milk, butter, sugar, salt and eggs. Beat on medium speed for 3 minutes. Stir in enough of the remaining flour to form a firm dough. Turn out onto a floured surface and knead until smooth and elastic, 6 to 8 minutes. Place in a greased bowl, turning once to grease the top. Cover and refrigerate overnight.\r"},{"text":"For the caramel: Bring the brown sugar, butter and cream to a boil. Cook and stir for 3 minutes. Pour half into the greased bundt pan and sprinkle with the pecans.\r"},{"text":"For assembly: Punch the risen dough down and shape into 40 balls (1 to 1 inches in diameter). Mix together the sugar and cinnamon in a shallow bowl.\r"},{"text":"Pour the melted butter into another bowl. Roll the balls in the butter and then roll in the cinnamon-sugar mixture. Place 20 balls in the bundt pan and top with remaining caramel and the pecans. Lastly, place the final 20 balls of dough into the pan. Cover the bundt pan and let rise until doubled, about 45 minutes.\r"},{"text":"Preheat the oven to 350 degrees F.\r"},{"text":"Bake until the top is a deep golden brown, 45 to 50 minutes. Cool for 10 minutes before inverting onto a serving plate. Serve warm.\r"}],"id":"pecan_pie_monkey_bread","prepTime":40},{"name":"Brussel Sprouts Salad","author":"Wegmans","ingredients":[{"text":"1 pkg (14 oz) shredded brussel spruts"},{"text":"3/4 cup  white balsalmic vinegarette"},{"text":"1 red pepper, 1/4-inch dice (about 1 cup)"},{"text":"1/2 cup salted, dry roasted almonds, rough chopped"},{"text":"1/2 cup dried cranberries"},{"text":"1/2 bunch (3-4) green onions, thinly sliced (about 1/2 cup)"},{"text":"1 Tbsp white sugar"},{"text":"Salt and pepper to taste"}],"inactiveTime":30,"servings":8,"steps":[{"text":"Add Brussels sprouts, vinaigrette, red pepper, almonds, cranberries, raisins, onion, and sugar to mixing bowl; toss to combine. Season to taste with salt and pepper."},{"text":"Chill at least 30 min."}],"id":"brussel_sprouts_salad","prepTime":15},{"description":"A tasty twist on stuffed peppers","ingredients":[{"text":"2 cups quinoa"},{"text":"3 cups chicken stock"},{"text":"4 cloves garlic, smashed"},{"text":"1 sprig rosemary"},{"text":"10 red bell peppers"},{"text":"1 and 1/2 pounds hot italian poultry sausage"},{"text":"1 large onion, chopped"},{"text":"3 stalks celery, chopped"},{"text":"1 block feta, crumbled"},{"text":"2 containers goat cheese crumbles"},{"text":"2 tablespoons sage, chopped"},{"text":"2 tablespoons rosemary"},{"text":"garlic"}],"author":"Melissa Laughlin","cookTime":45,"steps":[{"text":"Rinse quinoa under cold water for 2 minutes.  Toast quinoa in a pot for several minutes."},{"text":"Add stock, smashed garlic, rosemary, and salt.  Bring to the boil, cover and simmer for 15 minutes.  Let stand covered for 5 minutes off the heat, then fluff with fork.  Remove rosemary stem."},{"text":"Preheat the over to 400 degrees."},{"text":"Cut the peppers in half and remove the stem and seeds.  In a large saute pan with olive oil, add the onion, celery, salt, and 1/2 a red bell pepper, chopped.  Cook over medium heat until translucent."},{"text":"Add the sausage, removed from casings, along with the sage.  Cook until the sausage is cooked through, breaking it up into crumbles.  Add garlic and saute for 1 minute.  Add the quinoa and stir to combine.  Let the filling cool before adding the cheese."},{"text":"Toss the pepper halves with olive oil, salt, and pepper on a baking sheet.  Fill the peppers with the quinoa mixture.  Roast on the bottom rack of the over for 15 minutes, then roast on the middle rack for 10 minutes."}],"servings":9,"id":"quinoa_stuffed_peppers","prepTime":20,"name":"Quinoa Stuffed Peppers"},{"name":"Almost-Famous Soft Pretzels","ingredients":[{"text":"1 cup milk\r"},{"text":"1 package active dry yeast\r"},{"text":"3 tablespoons packed light brown sugar\r"},{"text":"2 1/4 cups all-purpose flour, plus more for kneading\r"},{"text":"1 stick unsalted butter"},{"text":"1 teaspoon fine salt\r"},{"text":"1/6 cup baking soda"},{"text":"2 tablespoons coarse salt\r"}],"author":"Food Network Kitchen","cookTime":15,"inactiveTime":60,"servings":"6 full pretzels, or 18 sticks","steps":[{"text":"Warm the milk in a saucepan until it's about 110 degrees; pour into a medium bowl and sprinkle in the yeast. Let the yeast soften, about 2 minutes; stir in the brown sugar and 1 cup flour with a wooden spoon. Dice 2 tablespoons butter and soften; stir into the mix. Add the remaining 1 1/4 cups flour and the fine salt to make a sticky dough. Turn the dough out onto a lightly floured surface and knead, adding more flour if needed, until smooth but still slightly tacky, about 5 minutes. Shape into a ball, place in a lightly greased bowl and cover with plastic wrap. Let rise in a warm spot until doubled in size, about 1 hour."},{"text":"Preheat the oven to 450 degrees and grease a large baking sheet. Punch the dough to deflate it, then turn out onto a lightly floured surface. (If the dough seems tight, cover and let rest until it relaxes.) Divide the dough into 6 pieces. Roll and stretch each piece with the palms of your hands into a 30-inch rope, holding the ends and slapping the middle of the rope on the counter as you stretch. Form each rope into a pretzel shape.\r"},{"text":"Dissolve the baking soda in 1 1/2 cups warm water in a shallow baking dish. Gently dip each pretzel in the soda solution, then arrange on the prepared baking sheet and sprinkle with the coarse salt. Bake until golden, 9 to 10 minutes."},{"text":"Melt the remaining 8 tablespoons  butter in a shallow dish. Dip the hot pretzels in the butter, turning to coat; place on a wire rack to let excess butter drip off. Serve the pretzels warm with the sweet mustard sauce."}],"id":"almostfamous_soft_pretzels","prepTime":30},{"name":"Lentil Burgers with Lemon-Basil Mayonnaise","ingredients":[{"text":"1/2 cup extra-virgin olive oil"},{"text":"2 large shallots, minced"},{"text":"1 1/2 teaspoons kosher salt"},{"text":"1/2 teaspoon freshly ground black pepper"},{"text":"6 button mushrooms (about 4 ounces), finely diced"},{"text":"2 cloves garlic, minced"},{"text":"2 tablespoons chopped fresh thyme"},{"text":"1/2 cup frozen petite green peas, thawed"},{"text":"Two 15-ounce cans lentils, rinsed and drained"},{"text":"1/3 cup plus 1/2 cup cornmeal"},{"text":"2 tablespoons egg-free mayonnaise, such as Vegenaise"},{"text":"1 tablespoon fresh lemon juice"},{"text":"1 cup refrigerated egg-free mayonnaise, such as Vegenaise"},{"text":"1/2 cup chopped fresh basil"},{"text":"Zest of 1 large lemon"},{"text":"Twenty-two 1/2-inch-thick-slices country-style bread"},{"text":"1 avocado, seeded, peeled and thinly sliced, optional"},{"text":"2 Roma tomatoes, thinly sliced"},{"text":"1 head butter lettuce, leaves separated"}],"author":"Giada De Laurentiis","cookTime":20,"inactiveTime":30,"servings":4,"steps":[{"text":"For the burgers: Heat 1/4 cup of the oil over medium-high heat in a 12-inch nonstick skillet. Add the shallots, 3/4 teaspoon salt and 1/4 teaspoon pepper. Cook until soft, about 3 minutes. Add the mushrooms, garlic, thyme and the remaining 3/4 teaspoon of salt and 1/4 teaspoon pepper. Cook until the mushrooms are soft, 6 to 8 minutes. Set aside to cool slightly."},{"text":"Blend the peas and 1 can lentils until smooth in a blender. Transfer the pureed peas and lentils to a medium bowl. Add the remaining 1 can lentils, 1/3 cup cornmeal, mayonnaise, lemon juice and the mushroom mixture. Form 1/3-cupfuls of the mixture into eleven 3/4-inch-thick slider patties."},{"text":"Sprinkle 1/4 cup cornmeal on a baking sheet. Place the burgers on top of the cornmeal. Sprinkle the remaining 1/4 cup cornmeal on top of the burgers. Refrigerate for at least 30 minutes."},{"text":"Heat the remaining 1/4 cup oil over medium heat in the skillet. Cook the burgers until golden brown, about 4 minutes on each side."},{"text":"For the mayonnaise: Mix the mayonnaise, basil and lemon zest until smooth in a small bowl."},{"text":"Working in batches, place the bread in the skillet and cook until lightly toasted, 1 to 2 minutes on each side. The bread can also be grilled or toasted in an oven."},{"text":"Smear the mayonnaise on the bread and top with the lentil burgers. Serve with avocado if using, tomato, lettuce and top with the remaining the bread slices."}],"id":"lentil_burgers_with_lemonbasil_mayonnaise","prepTime":15},{"description":"http://blog.foodswithjudes.com/kale-quinoa-salad-copy-of-the-cheesecake-factory-version/","ingredients":[{"text":"1 1/2 cups quinoa, cooked"},{"text":"5 cups kale, thinly shredded"},{"text":"1 3/4 cup red seedless grapes, sliced in half"},{"text":"1/2 cup roasted sunflower seeds, unsalted"},{"text":"1/2 cup grated Romano or Parmesan cheese"},{"text":"2 tbsp lemon juice"},{"text":"2 tbsp olive oil"},{"text":"1 tbsp raw honey (not for babies under 1 year old)"},{"text":"1 tsp tahini"},{"text":"1 tsp dijon mustard"},{"text":"1 1/2 tsp crushed garlic"},{"text":"salt & pepper to taste"}],"author":"The Internet","steps":[{"text":"Cook 1/2 cup quinoa per package directions. Add all the dressing ingredients together in a jar and shake vigorously. Fold kale in half lengthwise along the stem. Tear kale leaves off stem."},{"text":"Stack leaves on top of each other and thinly chop kale. Add shredded kale to large bowl. Toss dressing with kale and message the dressing into kale for a couple of minutes. Add remaining salad ingredients and combine. Enjoy!"},{"text":"Shortcut: Cut several grapes at once by placing grapes in one layer on a cutting board. Press a flat lid or plate on top of the grapes. With one-hand press down on the flat lid. With the other hand holding a sharp knife, slice the grapes lengthwise between the lid and cutting board."}],"servings":8,"id":"kale_quinoa_salad","prepTime":25,"name":"Kale Quinoa Salad"},{"name":"Chicken Biscuit Pot Pie","author":"Alton Brown","ingredients":[{"text":"1 pound bulk-style chicken sausage"},{"text":"3 tablespoons unsalted butter"},{"text":"3 ounces all-purpose flour"},{"text":"2 cups whole milk"},{"text":"1 1/2 cups low-sodium chicken broth"},{"text":"1 plain rotisserie chicken"},{"text":"1 1/2 teaspoons kosher salt"},{"text":"1 1/2 teaspoon freshly chopped sage"},{"text":"1/2 teaspoon freshly ground black pepper"},{"text":"12 ounces all-purpose flour, plus extra for rolling"},{"text":"2 teaspoons aluminum-free baking powder"},{"text":"1/2 teaspoon baking soda"},{"text":"1 teaspoon kosher salt"},{"text":"1 teaspoon freshly chopped thyme"},{"text":"1 teaspoon freshly chopped sage"},{"text":"1/4 teaspoon cayenne pepper"},{"text":"4 ounces extra-sharp white Cheddar"},{"text":"4 ounces unsalted butter, frozen"},{"text":"7 ounces low-fat buttermilk"},{"text":"1 onion, chopped"},{"text":"5 carrots, chopped"},{"text":"4 ribs of celery, chopped"}],"cookTime":23,"inactiveTime":10,"servings":8,"steps":[{"text":"Preheat the oven to 400 degrees F."},{"text":"For the filling: Set a 10-inch cast-iron skillet over medium heat. Crumble the chicken sausage in the pan and cook, stirring occasionally, until no longer pink, about 6 minutes.  Remove from pan, and add onions and carrots.  Cook until carrots are soft. Add the butter and melt, stirring to coat the sausage. Sprinkle the flour onto the sausage and cook for 2 minutes, stirring frequently. Pour in the milk and chicken broth and scrape any browned bits off the bottom of the pan. Bring to a simmer and cook until sauce thickens, about 2 minutes. Add the shredded chicken, salt, sage, and pepper. Stir to combine and set aside while preparing the biscuits."},{"text":"For the biscuits: Combine the flour, baking powder, baking soda, salt, thyme, sage, and cayenne pepper in a medium mixing bowl and set aside."},{"text":"Grate the cheese and butter using the large shredding disk of a food processor or the large side of a box grater. Immediately add the cheese and butter to the flour mixture. Stir to combine. Pour in the buttermilk and stir just to combine. Dump the dough onto a floured work surface and start folding the dough over on itself, gently kneading for 30 seconds, or until the dough is soft and smooth. Press the dough into a 1/2-inch thick round. Use a 3-inch round cutter to cut out the biscuits, being sure to push the cutter straight down through the dough to the work surface. Make your cuts as close together as possible to limit waste. Gather together any remaining dough, pat out again, and cut out as many biscuits as you can in order to get 9 total."},{"text":"To build the pie: Set the biscuits on top of the filling, placing 8 around the edge of the pan and 1 in the middle. Bake until the biscuits are tall and golden brown, 15 to 20 minutes. Cool on a cooling rack for 10 minutes before serving."}],"id":"chicken_biscuit_pot_pie","prepTime":55},{"name":"Roasted Zucchini Flatbread","author":"Food Network Kitchen","ingredients":[{"text":"4 small zucchini, cut into 1/2-inch thick rounds (about 1 1/2 pounds)"},{"text":"2 tablespoons olive oil"},{"text":"Kosher salt"},{"text":"Flatbread"},{"text":"1/3 cup prepared hummus"},{"text":"1/4 cup crumbled goat cheese"},{"text":"2 cups baby arugula"},{"text":"1/4 cup blanched, slivered almonds"},{"text":"1 lemon, quartered, for serving"}],"cookTime":30,"options":{"isVegetarian":true},"steps":[{"text":"Preheat the oven to 400 degrees F. Place the zucchini on a baking sheet. Drizzle with the olive oil, then sprinkle with 1 teaspoon salt; mix well and spread to 1 layer. Roast until browned and very tender, about 30 minutes, stirring halfway through."},{"text":"Cook the flatbroad on high, about a minute each side, until done.  Spread each with 1 heaping tablespoon hummus. Top each piece with 1 tablespoon crumbled goat cheese, 1/4 of the roasted zucchini, about 1/2 cup baby arugula, and 1 tablespoon coarsely chopped almonds. Squeeze lemon wedge, drizzle extra virgin olive oil,  and add salt and pepper."}],"servings":4,"id":"roasted_zucchini_flatbread","prepTime":15},{"description":"","author":"Anne Burrell","ingredients":[{"text":"Extra-virgin olive oil"},{"text":"1/2 chicken, cut into 4 pieces ( chicken breast with drumattached, cut in half, thigh and leg)"},{"text":"Kosher salt"},{"text":"8 ounces fennel sausage, cut into bite-size pieces"},{"text":"1/2 Spanish onion, cut into 1/4-inch slices"},{"text":"3 cloves garlic, smashed and finely chopped"},{"text":"1/4 cup hot cherry pepper juice, from the jar"},{"text":"1/4 cup white wine"},{"text":"1 cup chicken stock, plus a little more if needed"},{"text":"4 or 5 quartered hot cherry peppers"},{"text":"1 sprig fresh oregano, leaves picked and chopped"}],"cookTime":85,"steps":[{"text":"Coat a large, wide pan with olive oil and bring the pan to a medium-high heat. Sprinkle the chicken generously with salt and add to the pan, skin-side down, in an even layer. Brown the chicken well on both sides."},{"text":"Once the chicken is brown on all sides, remove it from the pan and reserve. Drain the oil from the pan and return it to the heat. Coat the pan lightly with new olive oil. Add the sausage to the pan that the chicken was browned in. Brown the sausage well."},{"text":"Add the onions and season with salt. Cook the onions over medium heat until they are translucent and very aromatic, 6 to 7 minutes. Add the garlic and cook for 2 to 3 more minutes."},{"text":"Add the cherry pepper juice and wine to the pan and reduce it by half. While the wine is reducing, scrape any browned bits off the bottom of the pan. Return the chicken, skin-side up, to the pan and add the chicken stock and cherry peppers. Bring to a boil, reduce to a simmer and simmer, partially covered, for 15 minutes. Remove the lid and simmer for 5 more minutes; add more chicken stock if the stock has reduced too much. Stir in the oregano just before serving."},{"text":"Taste and adjust the seasoning if needed. The finished dish should be slightly soupy, spicy and delicious. Serve over the Soft Parmigiano Polenta."}],"servings":6,"id":"chicken_scarpariello","prepTime":105,"name":"Chicken Scarpariello"},{"name":"Flatbread","ingredients":[{"text":"3/4 teaspoon active dry yeast"},{"text":"Pinch of sugar"},{"text":"3 tablespoons extra-virgin olive oil, plus more for oiling"},{"text":"1 1/2 teaspoons salt"},{"text":"3 1/4 cups bread flour"}],"author":"Amy Thielen","options":{"isDairyFree":true,"isVegetarian":true,"isCrockPot":false,"isVegan":true},"steps":[{"text":"Combine the yeast, sugar and 1/4 cup lukewarm water in a small bowl and let the yeast puff up and proof."},{"text":"Pour the yeast mixture into a large bowl and add 1 cup lukewarm water, the oil and salt. Add 1 cup of the flour and whisk until smoothly combined. Switching to a wooden spoon, add the rest of the flour and stir until you have a soft dough. Rub the dough with a bit more oil, press a square of plastic wrap to its surface and let it rise at room temperature until doubled in size, about 1 hour."},{"text":"Punch down the dough, transfer it to an oiled plastic bag and let it proof in the refrigerator at least 4 hours or as long as 3 days."}],"servings":8,"id":"flatbread","prepTime":180},{"description":"You can also use grits instead of polenta - still good!","author":"Anne Burrell","ingredients":[{"text":"2 cups milk"},{"text":"1 bay leaf"},{"text":"Kosher salt"},{"text":"1 cup quick cooking polenta"},{"text":"1 cup grated Parmigiano"},{"text":"1/4 cup mascarpone cheese"}],"cookTime":15,"steps":[{"text":"In a medium saucepan, bring the milk, 2 cups water and the bay leaf to a boil. Season generously with salt, almost to the point of over seasoning. How do you know that you are there? TASTE IT!"},{"text":"When it has reached a boil, slowly whisk in the polenta in small sprinkles. Once all of the polenta has been incorporated, reduce the heat to medium and immediately switch over to stirring with a wooden spoon. Cook the polenta for 5 minutes over medium, medium-low, adding water if the polenta becomes too thick to loosen it up."},{"text":"When the polenta is thoroughly cooked, it should look creamy and not feel gritty on your tongue. Remove it from the heat and stir in the Parmigiano and mascarpone. Taste and adjust seasoning as needed. Serve immediately, or place a sheet of plastic wrap right on the surface of the polenta to prevent a skin from forming on the top. To reheat, add a little water to the polenta and heat over low to medium heat, stirring constantly to prevent burning."}],"id":"soft_parmigiano_polenta","prepTime":10,"name":"Soft Parmigiano Polenta"},{"name":"Salmon-Cilantro Burgers","ingredients":[{"text":"1/4 cup reduced-fat mayonnaise"},{"text":"1 tablespoon chopped fresh cilantro\r"},{"text":"1 tablespoon fresh lime juice\r"},{"text":"1/8 teaspoon salt"},{"text":"1/8 teaspoon freshly ground black pepper\r"},{"text":"1 (1-pound) salmon fillet, skinned and cut into 1-inch pieces"},{"text":"1/4 cup dry breadcrumbs\r"},{"text":"2 tablespoons cilantro leaves\r"},{"text":"2 tablespoons chopped green onions\r"},{"text":"1 tablespoon chopped seeded jalapeño pepper\r"},{"text":"2 tablespoons fresh lime juice\r"},{"text":"1/2 teaspoon salt"},{"text":"1/4 teaspoon freshly ground black pepper\r"},{"text":"Cooking spray"},{"text":"4 (1 1/2-ounce) hamburger buns with sesame seeds, toasted\r"},{"text":"12 (1/4-inch-thick) slices English cucumber"},{"text":"4 leaf lettuce leaves"}],"author":"Cooking Light","cookTime":15,"steps":[{"text":"Combine first 5 ingredients in a small bowl; cover and chill."},{"text":"Place salmon in a food processor; pulse until coarsely chopped. Add breadcrumbs and next 6 ingredients (through 1/4 teaspoon black pepper); pulse 4 times or until well blended. Divide salmon mixture into 4 equal portions, shaping each into a 3/4-inch-thick patty."},{"text":"Heat a grill pan over medium-high heat. Coat pan with cooking spray. Add patties to pan; cook 2 minutes. Carefully turn patties over; cook 2 minutes or until done."},{"text":"Spread about 1 tablespoon mayonnaise mixture over bottom half of each hamburger bun. Top each serving with 1 salmon patty, 3 cucumber slices, 1 lettuce leaf, and top half of bun."}],"servings":4,"id":"salmoncilantro_burgers","prepTime":15},{"name":"Spring Pasta Salad","author":"Melissa Laughlin","ingredients":[{"text":"1.5 lbs whole wheat farfalle pasta"},{"text":"4 carrots, chopped"},{"text":"2 stalks celery, chopped"},{"text":"1 pint cherry tomatoes, quartered"},{"text":"1 red onion, chopped and rinsed"},{"text":"1/3 lb sun dried tomatoes, chopped"},{"text":"1 lb shelled edamame"},{"text":"1 red bell pepper, chopped"},{"text":"1 yellow bell pepper, chopped"},{"text":"Sauce:"},{"text":"1.5 cup mayo"},{"text":"1 cup buttermilk"},{"text":"2 tbsp red wine vinegar"},{"text":"2 tbsp lemon juice"},{"text":"1 tbsp hot sauce"},{"text":"1 tbsp onion powder"},{"text":"1 tbsp garlic powder"},{"text":"1 tbsp dijon mustard"},{"text":"1 cup chopped chives"},{"text":"salt and pepper"}],"cookTime":null,"steps":[{"text":"Cook the pasta in salted water until al dente. During the last 5 minutes of cooking add the frozen edamame."},{"text":"Stir together the sauce ingredients."},{"text":"Add the veggies and pasta to the sauce.  Stir to combine."}],"servings":"8 (fills 8 lunch containers)","id":"spring_pasta_salad","prepTime":30,"description":"Cold pasta salad with lots of fresh veggies tossed in a tangy creamy sauce"},{"name":"Lasagna with Turkey Sausage","author":"Ina Garten","ingredients":[{"text":"2 tablespoons olive oil"},{"text":"1 cup chopped yellow onion (1 onion)"},{"text":"2 garlic cloves, minced"},{"text":"1 1/2 pounds sweet Italian turkey sausage, casings removed"},{"text":"1 (28-ounce) can crushed tomatoes in tomato puree"},{"text":"1 (6-ounce) can tomato paste"},{"text":"1/4 cup chopped fresh flat-leaf parsley, divided"},{"text":"1/2 cup chopped fresh basil leaves"},{"text":"Kosher salt"},{"text":"Freshly ground black pepper"},{"text":"1/2 pound lasagna noodles"},{"text":"15 ounces ricotta cheese"},{"text":"3 to 4 ounces creamy goat cheese, crumbled"},{"text":"1 cup grated Parmesan, plus 1/4 cup for sprinkling"},{"text":"1 extra-large egg, lightly beaten"},{"text":"1 pound fresh mozzarella, thinly sliced"}],"cookTime":95,"steps":[{"text":"Preheat the oven to 400 degrees F."},{"text":"Heat the olive oil in a large (10 to 12-inch) skillet. Add the onion and cook for 5 minutes over medium-low heat, until translucent. Add the garlic and cook for 1 more minute. Add the sausage and cook over medium-low heat, breaking it up with a fork, for 8 to 10 minutes, or until no longer pink. Add the tomatoes, tomato paste, 2 tablespoons of the parsley, the basil, 1 1/2 teaspoons salt, and 1/2 teaspoon pepper. Simmer, uncovered, over medium-low heat, for 15 to 20 minutes, until thickened."},{"text":"Meanwhile, fill a large bowl with the hottest tap water. Add the noodles and allow them to sit in the water for 20 minutes. Drain."},{"text":"In a medium bowl, combine the ricotta, goat cheese, 1 cup of Parmesan, the egg, the remaining 2 tablespoons of parsley, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Set aside."},{"text":"Ladle 1/3 of the sauce into a 9 by 12 by 2-inch rectangular baking dish, spreading the sauce over the bottom of the dish. Then add the layers as follows: half the pasta, half the mozzarella, half the ricotta, and one third of the sauce. Add the rest of the pasta, mozzarella, ricotta, and finally, sauce. Sprinkle with 1/4 cup of Parmesan. Bake for 30 minutes, until the sauce is bubbling."},{"text":"If this has been in the fridge, extend the baking time to an hour and a half."}],"servings":"8 servings","id":"lasagna_with_turkey_sausage","prepTime":20},{"name":"Brisket Rub","author":"Emeril Lagasse","ingredients":[{"text":"2 tablespoons dark brown sugar"},{"text":"2 tablespoons chili powder"},{"text":"2 tablespoons paprika"},{"text":"2 tablespoons salt"},{"text":"1 tablespoon garlic powder"},{"text":"1 tablespoon onion powder"},{"text":"1 tablespoon black pepper"},{"text":"1 tablespoon cayenne"},{"text":"2 teaspoons dry mustard"},{"text":"2 teaspoons ground cumin"}],"steps":[{"text":"Combine all of the ingredients, and rub on brisket.  Typically, you'll want to rub this on the brisket the night before, and then again right before placing in the smoker."},{"text":"Keep in mind this is for a 4lb brisket, so multiply as necessary."}],"servings":"1 4 lb brisket","id":"brisket_rub"},{"name":"Scallions on Toast","author":"Pat Laughlin","ingredients":[{"text":"3 bunches of green onions"},{"text":"2 tablespoons unsalted butter"},{"text":"2 tablespoons olive oil"},{"text":"2 garlic cloves, chopped"},{"text":"Salt and pepper to taste"}],"cookTime":20,"steps":[{"text":"Wash and cut the green onions into pieces, set aside."},{"text":"Put a pan on medium heat, add the olive oil and butter.  When the butter is melted, add the green onions, salt, and pepper, and cover the pan with a lid."},{"text":"Occasionally stir the green onions, cooking until very tender.  At the very end, add the garlic, toss and cook for around 30 seconds, turn off the heat, and put the lid back on the pan."},{"text":"Serve with toast."}],"servings":"1","id":"scallions_on_toast","options":{"isVegetarian":true},"prepTime":10},{"name":"Perfect Ribeye Steak","author":"Melissa Laughlin","ingredients":[{"text":"Thick-cut ribeye steak, at least an inch"},{"text":"2 tbsp canola oil"}],"cookTime":15,"steps":[{"text":"Pull the steak out of the fridge 30 minutes prior to cooking, blot dry, and generously salt both sides.  Rest for 30 minutes."},{"text":"Preheat the oven to 450 degrees."},{"text":"Heat up a cast iron pan under high heat, until smoking.  Wipe off the excess salt, and pat the steak dry.  Oil and salt both sides of the steak, and place in pan, ensuring maximum contact."},{"text":"Sear on the first side for 4 minutes, flip and sear on the other side for 3 minutes.  Place in the oven for 4 minutes."},{"text":"Remove the steak from the pan, and place on a plate, and cover with aluminum foil.  Rest for 10 minutes."}],"servings":"1 steak","id":"perfect_ribeye_steak","inactiveTime":10,"options":{"isGlutenFree":false},"prepTime":30},{"name":"The Tooth Cutter","author":"Melissa Laughlin","ingredients":[{"text":"3 shots vodka"},{"text":"1 cup sugar"},{"text":"1 cup water"},{"text":"1 lemon, peeled"},{"text":"2 sprigs rosemary"},{"text":"club soda"},{"text":"ice"}],"cookTime":15,"steps":[{"text":"Start by making a simple syrup, with the sugar, water, lemon peels, and rosemary.  Let cool until room temperature."},{"text":"Combine 2 1/2 tablespoons of the lemon syrup, the juice of the lemon, and vodka in a shaker.  Shake, and pour over ice in double old fashioned glasses, until glass is 2/3 full."},{"text":"Top with club soda, stir, and serve."}],"servings":"2-3 cocktails","inactiveTime":10,"id":"the_tooth_cutter","prepTime":5},{"name":"Zucchini-Tortilla Casserole (Pastel Azteca)","author":"Marcela Valladolid","ingredients":[{"text":"12 corn tortillas"},{"text":"2 tablespoons vegetable oil"},{"text":"2 cloves garlic, chopped"},{"text":"1 small white onion, chopped"},{"text":"2 large tomatoes, boiled 30 seconds, peeled, and pureed (to yield 2 cups)"},{"text":"3 tablespoons unsalted butter"},{"text":"4 1/2 cups chopped zucchini (from 3 large zucchini)"},{"text":"1 1/2 cup fresh corn off the cob (from 1 ear)"},{"text":"3 poblano chiles charred, seeded, deveined, and chopped"},{"text":"Kosher salt and freshly ground black pepper"},{"text":"Nonstick cooking spray"},{"text":"3 cups shredded Oaxaca cheese, or Monterey Jack"},{"text":"3/4 cup Mexican crema or creme fraiche"}],"cookTime":30,"steps":[{"text":"Preheat the oven to 350 degrees F.  Char the tortillas over an open flame, just for a little bit of color."},{"text":"In a medium saute pan over medium heat, heat 2 tablespoons vegetable oil and add the garlic and onion. Saute until the onion is translucent, about 3 minutes. Add the tomato puree. Cook for 10 minutes and turn the heat off."},{"text":"In a separate large saute pan over medium heat, melt the butter. Add the zucchini and corn. Cook for 2 minutes, and then add the chopped poblano chiles. Add 1/2 cup water to the mixture and cook for 4 more minutes. Season with salt and pepper."},{"text":"Spray a 9-by-13-inch baking dish with a nonstick cooking spray. Cover the bottom with about 4 tortillas. Add 1/2 cup of the tomato mixture on top of the tortillas. Top with 1 1/2 cups of the zucchini mixture. Add 1 cup of the cheese. Drizzle with 1/4 cup of Mexican crema. Sprinkle the first layer with some salt and pepper. Start on the second layer with the tortillas, then the tomato, zucchini, cheese and Mexican crema. Again sprinkle with some salt and pepper. Repeat for a third time, to finish off a third layer. Place the casserole into the oven until the cheese is melted, 10 to 15 minutes. Serve hot."}],"servings":"8 servings","id":"zucchinitortilla_casserole_pastel_azteca","options":{"isCrockPot":false,"isVegetarian":true},"prepTime":20},{"description":"This recipe is great with cucumbers, but you can use almost any other vegetable, too","author":"Ted Allen","ingredients":[{"text":"10 cloves garlic, peeled"},{"text":"2 cups white vinegar"},{"text":"6 teaspoons kosher salt"},{"text":"Several sprigs of fresh dill"},{"text":"1 teaspoon coriander seed"},{"text":"1 teaspoon mustard seed"},{"text":"1 teaspoon black peppercorns"},{"text":"6 Kirby cucumbers, quartered lengthwise"},{"text":"6 young spring carrots, peeled and cut in half lengthwise"},{"text":"1 handful large scallion pieces or green beans"},{"text":"A few pieces of cauliflower to tuck wherever they'll fit"},{"text":"4 small hot red chiles or 2 jalapenos"}],"cookTime":5,"steps":[{"text":"In a medium saucepan, bring 4 cups water to a boil, reduce the heat so the water simmers and add the garlic. Cook for 5 minutes. Add the vinegar and salt, raise the heat and bring to a boil, stirring until the salt dissolves. Remove from the heat."},{"text":"In 2 clear 1-quart jars, place a few sprigs of dill. Divide the seeds and peppercorns between the jars. Using tongs, remove the garlic from the brine and place 5 cloves in each jar. Then pack the jars full of cucumbers, carrots, scallions or green beans, cauliflower and chiles. You want them to be tightly stuffed."},{"text":"Bring the brine back to a boil, pour it over the vegetables to cover completely, let cool, then cover and refrigerate. The pickles will taste good in just a few hours, better after a couple of days. And they'll keep for about 3 months."}],"servings":"2 quarts","id":"refrigerator_pickles","prepTime":35,"name":"Refrigerator Pickles"},{"name":"Rosemary Garlic Potatoes","author":"Melissa Laughlin","ingredients":[{"text":"1 lb fingerling potatoes"},{"text":"4 cloves of garlic, minced"},{"text":"1 rosemary sprig, chopped"},{"text":"olive oil"},{"text":"extra virgin olive oil"},{"text":"white wine vinegar"},{"text":"salt and pepper to taste"}],"cookTime":35,"steps":[{"text":"Boil the potatoes in salted water until just short of done (about 20-25 minutes).  Drain, and the cut the potatoes in half, lengthwise.  Coat with olive oil, salt, and pepper."},{"text":"Combine the garlic, rosemary, extra virgin olive oil, white wine vinegar, salt and pepper to make the vingarette."},{"text":"Grill the potatoes on both sides, at medium heat.  This is just to add a bit of crispness and color.  As soon as their done, place in the vinagrette and coat evenly.  Allow potatoes to sit until absorbed."}],"servings":"4","id":"rosemary_garlic_potatoes","options":{"isVegetarian":true},"prepTime":10},{"name":"Rosemary Garlic Grilled Chicken","author":"Melissa Laughlin","ingredients":[{"text":"4 chicken breasts, bone-in"},{"text":"1.5 quarts of water"},{"text":"4 1/2 tablespoons kosher salt"},{"text":"3 tablespoons sugar"},{"text":"1 lemon, zested"},{"text":"4 cloves of garlic, minced"},{"text":"1 rosemary spring, chopped"},{"text":"extra virgin olive oil"},{"text":"olive oil"},{"text":"salt"},{"text":"pepper"}],"cookTime":20,"inactiveTime":10,"servings":"4","steps":[{"text":"Combine the water, kosher salt, and sugar in a large container.  Stir until dissolved, then add the chicken.  Let it sit in the fridge for 1 1/2 to 2 hours."},{"text":"Remove the chicken from the brine, rinse, then dry thoroughly.  Combine the lemon, garlic, rosemary, and pepper.  Add enough extra virgin olive oil to combine the ingredients."},{"text":"Loosen the skin from the chicken breast with your finger, being careful to not completely remove it.  Rub the mixture underneath the skin.  Place the chicken in a vaccuum sealed bag, and seal.  Place in the fridge for at least 2 hours."},{"text":"Preheat the grill to medium heat.  Remove the chicken from the bag, and rub with olive oil, pepper, and a little salt.  Grill for about 20 minutes, turning once, or until an internal temperature of 155-160F is reached."},{"text":"Remove from the grill, cover, and let sit for at least 10 minutes."}],"id":"rosemary_garlic_grilled_chicken","prepTime":240},{"name":"Crepes","author":"Alton Brown","ingredients":[{"text":"2 large eggs"},{"text":"3/4 cup milk"},{"text":"1/2 cup water"},{"text":"3 tablespoons butter, melted"},{"text":"1 cup flour"}],"cookTime":20,"inactiveTime":60,"servings":"12 crepes, approximately","steps":[{"text":"In a blender, combine all of the ingredients and pulse for 10 seconds. Place the crepe batter in the refrigerator for 1 hour. This allows the bubbles to subside so the crepes will be less likely to tear during cooking. The batter will keep for up to 48 hours."},{"text":"Heat a small non-stick pan. Add butter to coat. Pour 1 ounce of batter into the center of the pan and swirl to spread evenly. Cook for 30 seconds and flip. Cook for another 10 seconds and remove to the cutting board. Lay them out flat so they can cool. Continue until all batter is gone. After they have cooled you can stack them and store in sealable plastic bags in the refrigerator for several days or in the freezer for up to two months. When using frozen crepes, thaw on a rack before gently peeling apart."},{"text":"If you only have egg whites, combine 1 tablespoon vegetable oil in a measuring cup, and fill to 1/2 line."}],"id":"crepes","prepTime":5},{"name":"Granola","author":"Alton Brown","ingredients":[{"text":"3 cups rolled oats"},{"text":"1 cup slivered almonds"},{"text":"1 cup cashews"},{"text":"3/4 cup shredded sweet coconut"},{"text":"1/4 cup plus 2 tablespoons dark brown sugar"},{"text":"1/4 cup plus 2 tablespoons maple syrup"},{"text":"1/4 cup vegetable oil"},{"text":"3/4 teaspoon salt"}],"cookTime":75,"steps":[{"text":"Preheat oven to 250 degrees F."},{"text":"In a large bowl, combine the oats, nuts, coconut, and brown sugar."},{"text":"In a separate bowl, combine maple syrup, oil, and salt. Combine both mixtures and pour onto 2 sheet pans. Cook for 1 hour and 15 minutes, stirring every 15 minutes to achieve an even color."},{"text":"Remove from oven and transfer into a large bowl. Add raisins and mix until evenly distributed."}],"servings":"6","id":"granola","prepTime":10},{"name":"Corned Beef Hash","author":"Pat Laughlin","ingredients":[{"text":"3 cups corned beef, cooked and cut into 1/2 inch cubes"},{"text":"3 medium potatoes, cut into 1/2 inch cubes"},{"text":"1 medium onion, chopped"},{"text":"parsely, chopped"}],"cookTime":45,"steps":[{"text":"Put the potatoes in a pan over medium heat, with around 3 tablespoons of oil.  Generously salt and pepper the potatoes. Cook potatoes about 20 minutes, tossing every 5 minutes or so until golden brown and fork tender."},{"text":"Remove potatoes from pan, and set aside.  Add 2 tablespoons of oil to pan, along with onions.  Add salt and pepper, and cook until translucent - around 5 minutes.  When done, remove from pan and set aside."},{"text":"Add oil to the pan, then add the corned beef.  Cook for a few minutes, until there are a good amount of crispy bits.  Meanwhile, get a large skillet heating."},{"text":"Add the potatoes, onions, and corned beef to the large skillet, spreading evenly.  Cook for around 3 minutes, toss, and cook for another 3 minutes."},{"text":"Remove from heat, and add chopped parsely, and mix.  Serve with an egg on top - ideally poached or fried."}],"id":"corned_beef_hash","prepTime":10},{"name":"Mexican Corn","author":"Melissa Laughlin","ingredients":[{"text":"3 tablespoons mayo"},{"text":"1/2 lime, juiced"},{"text":"1/2 teaspoon cumin"},{"text":"1/2 teaspoon cayenne"},{"text":"3/4 teaspoon chili powder"},{"text":"1/2 cotija or queso fresco, crumbled"},{"text":"4 ears corn"}],"cookTime":12,"steps":[{"text":"Grill husked corn at medium to medium-low heat for 12 minutes, turning frequently. Remove from grill."},{"text":"Combine all ingredients besides cheese and corn in a bowl.  Spread on corn, then coat with crumbled cheese."}],"servings":"4 ears","id":"mexican_corn","options":{"isVegetarian":true},"prepTime":5},{"name":"Hawaiian Ahi Poke","ingredients":[{"text":"2 large sashimi grade Ahi tuna steaks (about 1 1/2 pounds)"},{"text":"1 shallot, sliced (or Maui onions)"},{"text":"1/2 cup chopped green onion"},{"text":"3 tablespoons soy sauce"},{"text":"1 teaspoon sesame oil"},{"text":"1 teaspoon chili garlic sauce"},{"text":"1 tablespoon sesame seeds"}],"author":"Melissa Laughlin","cookTime":0,"inactiveTime":0,"servings":"6 to 8","steps":[{"text":"Pat the Ahi tuna dry, then neatly cut it into small 1/2 inch cubes. Place in a bowl."},{"text":"Add the shallots, green onion, soy sauce, sesame oil, chili garlic sauce, and sesame seeds."},{"text":"Gently toss. Serve immediately or cover and refrigerate. *For another variation, omit the chili sauce and add 1/2 teaspoon wasabi paste and 1 teaspoon honey. You can also add a fresh avocado if you so desire!"}],"id":"hawaiian_ahi_poke","prepTime":8},{"name":"Apple Pie","ingredients":[{"text":"2 pie crusts"},{"text":"6 cups apples, peeled and thinly sliced"},{"text":"1/2 to 3/4 cup sugar"},{"text":"2 tablespoons flour"},{"text":"3/4 teaspoon cinnamon"},{"text":"1/4 teaspoon salt"},{"text":"1/8 teaspoon nutmeg"},{"text":"1 tablespoon lemon juice"}],"author":"Melissa Laughin","cookTime":45,"steps":[{"text":"Preheat oven to 425 degrees."},{"text":"Combine all ingredients except for the pie crust in a large mixing bowl.  Adjust the sugar according to how sweet the apples are.  Place one of the piece crusts in the bottom of the pie pan, fill with filling.  Place the other pie crust on top, and press to seal.  Cut a couple holes for venting the steam."},{"text":"Use a pastry brush to apply heavy cream to the crust. Bake for 40 to 45 minute.  After the first 15 to 20 minutes, cover the edge of the crust with aluminum foil."},{"text":"Cool for at least 2 hours before serving."}],"servings":"One Pat","inactiveTime":120,"id":"apple_pie","prepTime":15},{"name":"Chocolate Chip Cookies","ingredients":[{"text":"4 1/2 cups all-purpose flour"},{"text":"2 teaspoons baking soda"},{"text":"2 cups unsalted butter, softened"},{"text":"1 1/2 cups packed dark brown sugar"},{"text":"1/2 cup white sugar"},{"text":"2 (3.4 ounce) packages instant vanilla pudding mix"},{"text":"4 eggs"},{"text":"4 teaspoons vanilla extract"},{"text":"4 cups semisweet chocolate chips"},{"text":"2 cups chopped walnuts (optional)"},{"text":"2 teaspoons kosher salt"}],"author":"Joyce Arreola","cookTime":12,"options":{"isVegetarian":true},"steps":[{"text":"Preheat oven to 350 degrees F (175 degrees C). Sift together the flour and baking soda, set aside."},{"text":"In a large bowl, cream together the butter, brown sugar, and white sugar. Beat in the instant pudding mix until blended. Stir in the eggs and vanilla. Blend in the flour mixture. Finally, stir in the chocolate chips and nuts. Drop cookies by rounded spoonfuls (black scoop) onto ungreased cookie sheets."},{"text":"Bake for 13 to 14 minutes in the preheated oven. Edges should be golden brown.  If frozen, cook for 17 minutes."}],"servings":"7 dozen cookies","id":"chocolate_chip_cookies","prepTime":15},{"name":"Pie Crust","author":"Ina Garten","ingredients":[{"text":"12 tablespoons (1 1/2 sticks) very cold unsalted butter"},{"text":"3 cups all-purpose flour"},{"text":"1 tablespoon sugar"},{"text":"1 teaspoon kosher salt"},{"text":"1/3 cup very cold vegetable shortening, such as Crisco"},{"text":"1/2 cup ice water"}],"steps":[{"text":"Cut the butter in 1/2 inch dice and return it to the refrigerator while you prepare the flour mixture. Place the flour, sugar and salt in the bowl of a food processor fitted with a steel blade and pulse a few times to mix. Add the butter and shortening. Pulse 8 to 12 times, until the butter is the size of peas. With the machine running, pour the ice water down the feed tube and pulse the machine until the dough begins to form a ball. Dump out onto a floured board and roll into a ball. Wrap in plastic wrap and refrigerate for 30 minutes."},{"text":"Cut the dough in half. Roll each piece on a well-floured board into a circle at least 1 inch larger than the pie pan, rolling from the center to the edge, turning and flouring the dough so it doesn't stick to the board. (You should see bits of butter in the dough.) Fold the dough in half, ease it into the pie pan without stretching at all and unfold to fit the pan. With a small sharp paring knife, cut the dough 1 inch larger around than the pan. Fold the edge under and crimp the edge with either your fingers or the tines of a fork."}],"servings":"2 pie crusts","id":"pie_crust","prepTime":55},{"name":"Beef Stroganoff","ingredients":[{"text":"3 cups beef stock"},{"text":"1 carrot, chopped"},{"text":"6 sprigs fresh thyme"},{"text":"1 bay leaf"},{"text":"2 pounds chuck roast, cut into 2-inch cubes"},{"text":"Kosher salt and freshly ground black pepper"},{"text":"6 tablespoons extra-virgin olive oil"},{"text":"1 medium onion, chopped"},{"text":"2 tablespoons cognac"},{"text":"5 tablespoons unsalted butter"},{"text":"1 pound mushrooms, sliced"},{"text":"3 cloves garlic, chopped"},{"text":"1/3 cup sour cream, plus more for garnish"},{"text":"1 tablespoon Dijon mustard"},{"text":"2 tablespoons chopped fresh parsley leaves, plus more for garnish"},{"text":"1 (1-pound) package wide egg noodles"}],"author":"Tyler Florence","cookTime":180,"steps":[{"text":"Heat the beef stock with the carrot, 3 thyme sprigs, and bay leaf. Pat the beef dry and season it with salt and pepper. Heat 3 tablespoons oil in a large heavy bottomed skillet over high heat. Fry the meat in batches so that it is browned on all sides. Lower the heat to medium and return all the meat to the pot. Add the onions and cook until they are soft, about 5 minutes. Pour in the cognac and cook until the alcohol has burned off, about 5 minutes. Add the beef stock, discarding the carrot, thyme sprigs, and bay leaf. Cook, partially covered, over a very low flame for 1 1/2 to 2 hours."},{"text":"In a large skillet over medium heat, melt 3 tablespoons butter in the remaining 3 tablespoons olive oil. Add the mushrooms, garlic, and remaining 3 thyme sprigs and cook until the mushrooms are browned and cooked through. Remove from heat and set aside."},{"text":"When the meat is done, remove it from the heat and fold in the mushrooms, sour cream, mustard, and parsley. Taste and adjust the seasoning with salt and pepper."},{"text":"Meanwhile, cook the noodles in a large pot of boiling, salted water until tender. Drain the noodles well, toss with the remaining 2 tablespoons butter, and season with salt and pepper. Serve the stroganoff over the noodles; garnish with more sour cream and chopped parsley."}],"servings":"6 servings","id":"beef_stroganoff","prepTime":25},{"name":"Muffuletta Olive Salad","ingredients":[{"text":"1 quart pimiento-stuffed large green olives"},{"text":"1 1/2 cups large Greek black olives"},{"text":"1 1/2 cups olive oil"},{"text":"1 cup pickled cauliflower (or giardinera), drained"},{"text":"1/4 bunch celery"},{"text":"2 medium carrots, peeled"},{"text":"1/2 cup pepperoncini, drained"},{"text":"1/3 cup cocktail onions, drained"},{"text":"1/4 cup small capers, drained"},{"text":"8 cloves garlic"},{"text":"1 1/2 teaspoons Italian seasoning"},{"text":"3/4 teaspoons red pepper flakes"},{"text":"1/4 teaspoons ground black pepper"}],"author":"Emeril Lagasse","options":{"isDairyFree":true,"isVegetarian":true,"isVegan":true,"isGlutenFree":false},"steps":[{"text":"Chop all vegetable ingredients individually in a food processor, then add all ingredients in a large mixing bowl, and mix.  Store mixture in glass containers in the fridge for at least 24 hours."}],"servings":"2 quarts","id":"muffuletta_olive_salad","prepTime":20},{"name":"French Toast Casserole","ingredients":[{"text":"1 loaf French bread (13 to 16 ounces)"},{"text":"6 large eggs"},{"text":"2 cups half-and-half"},{"text":"1 cup milk"},{"text":"2 tablespoons granulated sugar"},{"text":"1 teaspoon vanilla extract"},{"text":"1 teaspoon ground cinnamon"},{"text":"1/2 teaspoon ground nutmeg"},{"text":"Dash salt"},{"text":"Praline Topping, recipe follows"},{"text":"Maple syrup"},{"text":"1/4 pound (1 stick) butter"},{"text":"1 cup packed light brown sugar"},{"text":"1 cup chopped pecans"},{"text":"2 tablespoons light corn syrup"},{"text":"1/2 teaspoon ground cinnamon"},{"text":"1/2 teaspoon ground nutmeg"}],"author":"Paula Deen","cookTime":40,"inactiveTime":96,"servings":"6 to 8 servings","steps":[{"text":"Dry fresh bread, cut into cubes, in a 300 degree oven for 15 minutes. Arrange bread in a generously buttered 9 by 13-inch flat baking dish in 2 rows, overlapping the slices. In a large bowl, combine the eggs, half-and-half, milk, sugar, vanilla, cinnamon, nutmeg and salt and beat with a rotary beater or whisk until blended but not too bubbly. Pour mixture over the bread slices, making sure all are covered evenly with the milk-egg mixture. Spoon some of the mixture in between the slices. Cover with foil and refrigerate overnight."},{"text":"The next day, preheat oven to 350 degrees F."},{"text":"Combine all ingredients after maple syrup in a bowl, and spread evenly over the bread and bake for 40 minutes, until puffed and lightly golden. Serve with maple syrup."}],"id":"french_toast_casserole","prepTime":20},{"name":"Italian Wedding Soup","ingredients":[{"text":"1 small onion, grated"},{"text":"1/3 cup chopped fresh Italian parsley"},{"text":"1 large egg"},{"text":"1 teaspoon minced garlic"},{"text":"1 teaspoon salt"},{"text":"1 slice fresh white bread, crust trimmed, bread torn into small pieces"},{"text":"1/2 cup grated Parmesan"},{"text":"8 ounces ground beef"},{"text":"8 ounces ground pork"},{"text":"Freshly ground black pepper"},{"text":"12 cups low-sodium chicken broth"},{"text":"1 pound kale, coarsely chopped (1 pound of escarole would be a good substitution)"},{"text":"2 large eggs"},{"text":"2 tablespoon freshly grated Parmesan, plus extra for garnish"},{"text":"Salt and freshly ground black pepper"},{"text":"1 cup acini de pepe (very small pasta)"}],"author":"Giada De Laurentiis","cookTime":20,"steps":[{"text":"To make the meatballs: Stir the first 6 ingredients in a large bowl to blend. Stir in the cheese, beef and pork. Fry off a small patty in order to taste.  Using 1 1/2 teaspoons for each, shape the meat mixture into 1-inch-diameter meatballs. Place on a baking sheet."},{"text":"To make the soup: Bring the broth to a boil in a large pot over medium-high heat. Add the meatballs and curly endive and simmer until the meatballs are cooked through and the curly endive is tender, about 8 minutes. Whisk the eggs and cheese in a medium bowl to blend. Stir the soup in a circular motion. Gradually drizzle the egg mixture into the moving broth, stirring gently with a fork to form thin stands of egg, about 1 minute. Add in the pasta.  Season the soup to taste with salt and pepper."},{"text":"Ladle the soup into bowls and serve. Finish soup with parmesan cheese if desired."}],"servings":"8 servings","id":"italian_wedding_soup","prepTime":15},{"name":"Zucchini Gratin","author":"Ina Garten","ingredients":[{"text":"6 tablespoons (3/4 stick) unsalted butter, plus extra for topping"},{"text":"1 pound yellow onions, cut in 1/2 and sliced (3 large)"},{"text":"2 pounds zucchini, sliced 1/4-inch thick (4 zucchini)"},{"text":"2 teaspoons kosher salt"},{"text":"1 teaspoon freshly ground black pepper"},{"text":"1/4 teaspoon ground nutmeg"},{"text":"2 tablespoons all-purpose flour"},{"text":"1 cup hot milk"},{"text":"3/4 cup fresh bread crumbs"},{"text":"3/4 cup grated Gruyere"}],"cookTime":55,"steps":[{"text":"Preheat the oven to 400 degrees F."},{"text":"Melt the butter in a very large (12-inch) saute pan and cook the onions over low heat for 20 minutes, or until tender but not browned. Add the zucchini and cook, covered, for 10 minutes, or until tender. Add the salt, pepper, and nutmeg and cook uncovered for 5 more minutes. Stir in the flour. Add the hot milk and cook over low heat for a few minutes, until it makes a sauce. Pour the mixture into an 8 by 10-inch baking dish."},{"text":"Combine the bread crumbs and Gruyere and sprinkle on top of the zucchini mixture. Dot with 1 tablespoon of butter cut into small bits and bake for 20 minutes, or until bubbly and browned."}],"servings":"6 servings","id":"zucchini_gratin","options":{"isVegetarian":true},"prepTime":10},{"name":"Hash Brown Casserole","author":"allrecipes.com","ingredients":[{"text":"1 (2 pound) package frozen hash brown potatoes, thawed"},{"text":"1/2 cup melted butter"},{"text":"1 can cream of chicken soup (or use the gluten free recipe)"},{"text":"1 (8 ounce) container sour cream"},{"text":"1/2 cup chopped onions"},{"text":"2 cups shredded Cheddar cheese"},{"text":"1 teaspoon salt"},{"text":"1/4 teaspoon ground black pepper"},{"text":"2 cups crushed cornflakes cereal"},{"text":"1/4 cup melted butter"}],"cookTime":40,"steps":[{"text":"Preheat oven to 350 degrees F (175 degrees C)."},{"text":"In a large bowl, combine hash browns, 1/2 cup melted butter, cream of chicken soup, sour cream, chopped onion, Cheddar cheese, salt and pepper. Place mixture in a 3 quart casserole dish."},{"text":"In a medium saucepan over medium heat, saute cornflakes in 1/4 cup melted butter, and sprinkle the mixture over the top of the casserole."},{"text":"Bake covered in preheated oven for 40 minutes."}],"servings":"12 servings","id":"hash_brown_casserole","options":{"isGlutenFree":true},"prepTime":20},{"name":"Blueberry Scones with Lemon Glaze","author":"Tyler Florence","ingredients":[{"text":"2 cups all-purpose flour"},{"text":"1 tablespoon baking powder"},{"text":"1/2 teaspoon salt"},{"text":"2 tablespoons sugar"},{"text":"5 tablespoons unsalted butter, cold, cut in chunks"},{"text":"1 cup fresh blueberries"},{"text":"1 cup light cream, plus more for brushing the scones"},{"text":"1/6 cup freshly squeezed lemon juice"},{"text":"2/3 cups confectioners' sugar, sifted"},{"text":"1 tablespoon unsalted butter"},{"text":"1 lemon, zest finely grated"}],"cookTime":20,"steps":[{"text":"Preheat the oven to 400 degrees F."},{"text":"Sift together the dry ingredients; the flour, baking powder, salt, and sugar. Using 2 forks or a pastry blender, cut in the butter to coat the pieces with the flour. The mixture should look like coarse crumbs. Fold the blueberries into the batter. Take care not to mash or bruise the blueberries because their strong color will bleed into the dough. Make a well in the center and pour in the light cream. Fold everything together just to incorporate; do not overwork the dough."},{"text":"Press the dough out on a lightly floured surface into a rectangle about 12 by 3 by 1 1/4 inches. Cut the rectangle in 1/2 then cut the pieces in 1/2 again, giving you 4 (3-inch) squares. Cut the squares in 1/2 on a diagonal to give you the classic triangle shape. Place the scones on an ungreased cookie sheet and brush the tops with a little heavy cream. Bake for 15 to 20 minutes until beautiful and brown. Let the scones cool a bit before you apply the glaze."},{"text":"You can make the lemon glaze in a double boiler, or for a simpler alternative, you can zap it in the microwave. Mix the lemon juice with the confectioners' until dissolved in a heatproof bowl over a pot of simmering water for the double-boiler method, or in a microwave-safe bowl. Whisk in the butter and lemon zest. Either nuke the glaze for 30 seconds or continue whisking in the double boiler. Whisk the glaze to smooth out any lumps, then drizzle the glaze over the top of the scones. Let it set a minute before serving."}],"servings":"8 scones","id":"blueberry_scones_with_lemon_glaze","prepTime":20},{"name":"Cream of Chicken Soup","author":"food.com","ingredients":[{"text":"1 cup milk (whichever kind you prefer)"},{"text":"3 tablespoons gluten-free flour or 2 tablespoons cornstarch"},{"text":"1 tablespoon butter, margarine or 1 tablespoon olive oil"},{"text":"1 teaspoon chicken bouillon granules (gluten free) or 1 bouillon cube (gluten free)"},{"text":"1⁄2 teaspoon salt (or to taste)"}],"cookTime":15,"steps":[{"text":"Whisk together the flour or cornstarch with the milk or milk substitute."},{"text":"Add the remaining ingredients and heat to a boil while whisking til fully dissolved and combined. Reduce heat and simmer a few minutes or until it thickens."},{"text":"Use this soup in recipes in place of one can of creamed soup."},{"text":"You could also add celery or mushrooms to make into other cream of soup flavors."}],"servings":"1 can equivalent","id":"cream_of_chicken_soup","options":{"isGlutenFree":true},"prepTime":null},{"name":"Pumpkin Cheesecake","ingredients":[{"text":"1 3/4 cups ginger snaps (around 35 cookies)"},{"text":"2 tablespoons light brown sugar"},{"text":"1/2 teaspoon ground cinnamon"},{"text":"1/2 stick melted salted butter"},{"text":"3 (8-ounce) packages cream cheese, at room temperature"},{"text":"1 (15-ounce) can pureed pumpkin"},{"text":"3 eggs plus 1 egg yolk"},{"text":"1/4 cup sour cream"},{"text":"1 1/2 cups sugar"},{"text":"1/2 teaspoon ground cinnamon"},{"text":"1/8 teaspoon fresh ground nutmeg"},{"text":"1/8 teaspoon ground cloves"},{"text":"2 tablespoon all-purpose flour"},{"text":"1 teaspoon vanilla extract"}],"author":"Paula Deen","cookTime":60,"inactiveTime":255,"servings":"8 slices","steps":[{"text":"In medium bowl, combine crumbs, sugar and cinnamon. Add melted butter. Press down flat into a 9-inch springform pan.  Bake for 5 to 8 minutes. Set aside."},{"text":"Using a stand mixer, beat cream cheese until smooth. Add pumpkin puree, eggs, egg yolk, sour cream, sugar and the spices. Add flour and vanilla. Beat together until well combined."},{"text":"Pour into crust. Spread out evenly and place in oven for 1 hour. Remove from the oven and let sit for 15 minutes. Cover with plastic wrap and refrigerate for 4 hours."}],"id":"pumpkin_cheesecake","prepTime":15},{"name":"Cranberry Sauce","ingredients":[{"text":"1/4 cup freshly squeezed orange juice"},{"text":"1/4 cup 100 percent cranberry juice, not cocktail"},{"text":"1 cup honey"},{"text":"1 pound fresh cranberries, approximately 4 cups"}],"author":"Alton Brown","cookTime":20,"inactiveTime":720,"servings":"6-8 servings","steps":[{"text":"Wash the cranberries and discard any soft or wrinkled ones."},{"text":"Combine the orange juice, cranberry juice and honey in a 2-quart saucepan over medium-high heat. Bring to a boil and then reduce the heat to medium-low and simmer for 5 minutes. Add the cranberries and cook for 15 minutes, stirring occasionally, until the cranberries burst and the mixture thickens. Do not cook for more than 15 minutes as the pectin will start to break down and the sauce will not set as well. Remove from the heat and allow to cool for 5 minutes."},{"text":"Carefully spoon the cranberry sauce into a 3 cup mold. Place in the refrigerator for at least 6 hours and up to overnight."},{"text":"Remove from the refrigerator, overturn the mold and slide out the sauce. Slice and serve."}],"id":"cranberry_sauce","prepTime":10},{"name":"Parker House Rolls","author":"Alex Guarnaschelli","ingredients":[{"text":"1 1/4 -ounce packet active dry yeast"},{"text":"1/2 cup sugar"},{"text":"7 1/2 to 8 cups all-purpose flour, plus more for dusting"},{"text":"12 tablespoons (1 1/2 sticks) unsalted butter, melted and cooled, plus softened butter for brushing"},{"text":"2 cups whole milk, at room temperature"},{"text":"2 large eggs, at room temperature"},{"text":"1 tablespoon kosher salt, plus more for sprinkling"}],"cookTime":20,"inactiveTime":120,"servings":"24 rolls","steps":[{"text":"Bloom the yeast."},{"text":"Measure out 1/2 cup warm water and check the temperature: It should be between 110 degrees F and 120 degrees F (comfortable bathwater temperature). Sprinkle the yeast into a large bowl, add the warm water and whisk in the sugar. Let sit 1 minute (it should bubble and froth slightly), then gently stir in 1 cup flour. Set aside near the stove while you prepare the dough."},{"text":"Make the dough."},{"text":"Mix the melted butter and milk in a mixer with the hook attachment on low speed. Add the eggs and mix until blended. Scrape in the yeast mixture and mix until incorporated. Add 6 1/2 cups flour and 1 tablespoon salt; mix until the dough forms a ball, 2 to 3 minutes, adding up to 1/2 cup more flour if the dough is too wet and sticky."},{"text":"Let it rise."},{"text":"Brush a large bowl with softened butter. Transfer the dough to the bowl, cover with a towel and let rise in a warm place, 2 hours to 2 hours, 30 minutes. The dough should double in volume."},{"text":"Shape the dough."},{"text":"Preheat the oven to 375 degrees F and line a baking sheet with parchment paper. Dust a clean flat surface with flour and turn the dough out onto it. Flour your hands; gently press the dough into a 16-by-8-inch rectangle, about 1/2 to 3/4 inch thick (don't use a rolling pin)."},{"text":"Cut the dough."},{"text":"With the short side in front of you, cut the dough in half lengthwise with a floured knife. Then slice crosswise into 12 strips."},{"text":"Shape the dough."},{"text":"One at a time, fold each strip of dough unevenly in half so the top part slightly overlaps the bottom half, then tuck the overhang underneath. Place the rolls seam-side down on the prepared baking sheet in 3 tightly packed rows. (If making in advance, wrap the baking sheet tightly in plastic wrap and freeze up to 3 weeks.)"},{"text":"Bake the rolls."},{"text":"Bake until the rolls are bursting at the seams and golden brown, 18 to 20 minutes. (If frozen, bake 25 minutes at 325 degrees F, then 10 minutes at 375 degrees F.) Remove from the oven and brush with softened butter. Sprinkle with salt and serve immediately."}],"id":"parker_house_rolls","prepTime":50},{"name":"Roast Turkey","author":"Melissa Laughlin","ingredients":[{"text":"1 (14 to 16 pound) fresh young turkey"},{"text":"1 cup kosher salt"},{"text":"1/2 cup light brown sugar"},{"text":"1 gallon vegetable stock"},{"text":"1 tablespoon black peppercorns"},{"text":"1 1/2 teaspoons allspice berries"},{"text":"1 1/2 teaspoons chopped candied ginger"},{"text":"1 gallon heavily iced water"},{"text":"1 c. dry white wine"},{"text":"1 c. chicken stock or broth"},{"text":"½ c. packed and chopped fresh flat-leaf parsley leaves"},{"text":"2 tbsp. chopped fresh sage leaves"},{"text":"2 sprig fresh sage leaves"},{"text":"1 tbsp. chopped fresh rosemary leaves"},{"text":"2 sprig fresh rosemary leaves"},{"text":"1 tsp. fresh thyme leaves"},{"text":"2 sprig fresh thyme leaves"},{"text":"½ c. unsalted butter"},{"text":"Kosher salt"},{"text":"pepper"},{"text":"1 medium onion"},{"text":"1 head garlic"}],"cookTime":150,"inactiveTime":420,"servings":"10 to 12 servings","steps":[{"text":"Combine the vegetable stock, salt, brown sugar, peppercorns, allspice berries, and candied ginger in a large stockpot over medium-high heat. Stir occasionally to dissolve solids and bring to a boil. Then remove the brine from the heat, cool to room temperature, and refrigerate."},{"text":"Combine the brine, water and ice in the 5-gallon bucket. Place the thawed turkey (with innards removed) breast side down in brine. If necessary, weigh down the bird to ensure it is fully immersed, cover, and refrigerate or set in cool area for 8 to 16 hours, turning the bird once half way through brining."},{"text":"Drain juices from turkey, discard neck and giblets, and pat turkey dry with paper towels. Place turkey, breast side up, on wire rack in large roasting pan (17-inch by 11 1/2-inch). Into pan, pour wine and chicken stock."},{"text":"In food processor with knife blade attached, pulse parsley leaves, sage leaves, rosemary leaves, and thyme leaves until very finely chopped. Add butter and pulse until well blended."},{"text":"Working from large cavity end of turkey, gently run fingers between skin and meat to loosen skin from flesh. Using rubber spatula, place three-quarters butter mixture under skin on both sides of breast bone. Gently massage skin to evenly distribute butter. Spread remaining herb butter all over outside of turkey. Sprinkle 1 1/2 tablespoons salt and 1 1/2 teaspoons freshly ground black pepper all over outside of turkey and inside cavity."},{"text":"Place onion, garlic, sage sprigs, rosemary sprigs, and thyme sprigs in cavity. With kitchen string, tie wings against body and tie drumsticks together."},{"text":"Roast the turkey on lowest level of the oven at 500 degrees F for 30 minutes. Insert a probe thermometer into thickest part of the breast and reduce the oven temperature to 350 degrees F. Set the thermometer alarm (if available) to 161 degrees F. A 14 to 16 pound bird should require a total of 2 to 2 1/2 hours of roasting. Let the turkey rest, loosely covered with foil or a large mixing bowl for 15 minutes before carving."}],"id":"roast_turkey","prepTime":15,"description":"A combination of Alton and Ina's turkeys"},{"name":"Maw Maw's Thanksgiving Stuffing","ingredients":[{"text":"4 cups day-old breadcrumbs"},{"text":"4 cups crumbled cornbread"},{"text":"4 cups crumbled biscuits"},{"text":"1 cup finely chopped yellow onion"},{"text":"1 cup finely chopped celery"},{"text":"1⁄4 cup chopped green onion"},{"text":"1⁄4 cup finely chopped fresh parsley"},{"text":"1 1⁄2 teaspoons sage"},{"text":"1 teaspoon salt"},{"text":"1⁄4 teaspoon pepper"},{"text":"1⁄2 cup melted butter"},{"text":"2 eggs, slightly beaten"},{"text":"2 -4 cups chicken broth (or more if needed)"}],"author":"Maw Maw?","cookTime":45,"steps":[{"text":"Pre-heat oven to 350F."},{"text":"In a very large mixing bowl, combine bread crumbs, crumbled cornbread, crumbled biscuits, yellow onions, celery, green onions, fresh parsley, sage, salt and pepper."},{"text":"Toss well."},{"text":"Add melted butter and eggs; mix."},{"text":"Add chicken broth, a little at a time, mixing lightly, but well."},{"text":"Add enough broth to make mixture extra moist."},{"text":"Place mixture into a well-greased baking dish."},{"text":"Bake about 45 minutes or until top is golden brown."},{"text":"~NOTE~This can be made ahead of time by mixing everything together, placing it in the well-greased baking dish, covering with foil, and refrigerating."},{"text":"To bake, remove from refrigerator and let sit at room temperature for about 30 minutes."},{"text":"Then, remove foil and bake for about 45 minutes."}],"servings":"16 servings","id":"maw_maws_thanksgiving_stuffing","prepTime":45},{"name":"Enchilada Sauce","author":"Melissa Laughlin","ingredients":[{"text":"1/4 cup vegetable oil"},{"text":"2 tablespoons flour"},{"text":"1/4 cup ancho chile powder"},{"text":"1 can tomato sauce"},{"text":"1 1/2 cups water"},{"text":"1 teaspoon ground cumin"},{"text":"1 teaspoon garlic powder"},{"text":"1 teaspoon onion powder"},{"text":"salt to taste"}],"cookTime":null,"steps":[{"text":"Heat oil in a skillet over medium-high heat. Stir in flour and chili powder, reduce heat to medium, and cook until lightly brown, stirring constantly to prevent burning flour."},{"text":"Gradually stir in tomato sauce, water, cumin, garlic powder, and onion salt into the flour and chili powder until smooth, and continue cooking over medium heat approximately 10 minutes, or until thickened slightly. Season to taste with salt."}],"servings":"6 servings","id":"enchilada_sauce","prepTime":10},{"description":"The go-to enchilada recipe","author":"Melissa Laughlin","ingredients":[{"text":"5 sweet potatoes"},{"text":"1 (8 oz) package whipped cream cheese"},{"text":"1 bunch green onions, chopped"},{"text":"1 teaspoon chili powder"},{"text":"1 teaspoon ground cumin"},{"text":"15 oz can black beans, drained and rinsed"},{"text":"1 teaspoon dried oregano"},{"text":"1 onion, chopped"},{"text":"8 ounces monterey jack, shredded"},{"text":"8 ounces cheddar, shredded"},{"text":"salt"},{"text":"pepper"},{"text":"30 pack of corn tortillas"},{"text":"1 (19 oz) can enchilada sauce, or Enchilada Sauce recipe"}],"cookTime":50,"steps":[{"text":"Bake sweet potatoes at 400 degrees for 1 hour, or until tender. Peel the sweet potatoes.  Saute the onion until golden brown."},{"text":"Place the sweet potatoes in a bowl, and mash them with the cream cheese.  Mix in the black beans, green onions, chili powder, cumin, oregano, salt, and pepper until well mixed."},{"text":"Preheat oven to 350 degrees F (175 degrees C), and grease a 13x9 inch baking dish."},{"text":"Place about 1/3 cup of sweet potato filling down the center of each tortilla, add some cheese, roll it up, and place filled tortillas seam side down in the prepared baking dish. Pour enchilada sauce over the tortillas, and sprinkle with Monterey Jack cheese."},{"text":"Bake in the preheated oven for 25 minutes, until the enchiladas are bubbling and the cheese is beginning to brown."}],"servings":"6 servings","id":"sweet_potato_enchiladas","options":{"isVegetarian":true},"prepTime":20,"name":"Sweet Potato Enchiladas"},{"name":"Creamy Tomato Soup","author":"Ina Garten","ingredients":[{"text":"3 tablespoons good olive oil"},{"text":"1 1/2 cups chopped red onions (2 onions)"},{"text":"2 carrots, peeled and chopped"},{"text":"1 tablespoon minced garlic (3 cloves)"},{"text":"3 28-ounce cans of San Marzano tomatoes"},{"text":"1 1/2 teaspoons sugar"},{"text":"1 tablespoon tomato paste"},{"text":"1/4 cup packed chopped fresh basil leaves, plus julienned basil leaves, for garnish"},{"text":"3 cups chicken stock, preferably homemade"},{"text":"1 tablespoon kosher salt"},{"text":"2 teaspoons freshly ground black pepper"},{"text":"3/4 cup heavy cream"}],"cookTime":60,"steps":[{"text":"Heat the olive oil in a large, heavy-bottomed pot over medium-low heat. Add the onions and carrots and saute for about 10 minutes, until very tender. Add the garlic and cook for 1 minute. Add the tomatoes, sugar, tomato paste, basil, chicken stock, salt, and pepper and stir well. Bring the soup to a boil, lower the heat, and simmer, uncovered, for 30 to 40 minutes, until the tomatoes are very tender."},{"text":"Add the cream to the soup and process it through a food mill into a bowl, discarding only the dry pulp that's left. Reheat the soup over low heat just until hot and serve with julienned basil leaves and/or croutons."}],"servings":"5 to 6 servings","id":"creamy_tomato_soup","prepTime":15},{"name":"Fluffy Pancakes","author":"Pat Laughlin","ingredients":[{"text":"about 1 1/2 cups milk"},{"text":"3 tablespoons white vinegar"},{"text":"2 cups all-purpose flour"},{"text":"1/4 cup sugar"},{"text":"2 teaspoons baking powder"},{"text":"1 teaspoon baking soda"},{"text":"1 teaspoon salt"},{"text":"2 eggs"},{"text":"1/4 cup butter, melted"}],"cookTime":10,"steps":[{"text":"Put vinegar in a small mixing bowl, and add enough milk to make 1 1/2 cups.  Let stand for about 5 minutes so the milk can sour."},{"text":"Combine flour, sugar, baking powder, baking soda, and salt in a large mixing bowl.  Whisk the eggs and butter into the soured milk."},{"text":"Make a well in the center of the dry ingredients, and pour in the milk mixture.  Whisk to combine and remove the lumps, then let stand for a few minutes."},{"text":"Heat a large skillet over medium heat.  Using a stick of butter, rub the pan, then pour some of the mixture int the pan.  Flip the pancake once you start seeing bubbles on the top.  Cook until brown on the other side."}],"servings":"13 5-inch pancakes","id":"fluffy_pancakes","prepTime":10},{"name":"Jalapeno Popper Dip","author":"allrecipes.com","ingredients":[{"text":"2 (8 oz) packages cream cheese, softened"},{"text":"1 cup mayonaisse"},{"text":"2 (4 oz) cans diced jalapenos, drained"},{"text":"1 (4 oz) can green chiles"},{"text":"1 cup grated parmesan"}],"cookTime":30,"steps":[{"text":"Preheat oven to 350 degrees F."},{"text":"Stir together cream cheese and mayonnaise in a large bowl until smooth. Stir in green chiles, grated parmesan, and jalapeno peppers. Pour mixture into a 8x8 oven safe container.  Sprinkle with extra parmesan cheese."},{"text":"Cook in the oven for 30 minutes.  Serve either hot or cold, with baguettes or chips."}],"servings":"32 servings","id":"jalapeno_popper_dip","options":{"isVegetarian":true},"prepTime":10},{"name":"Pad Thai","author":"Tyler Florence","ingredients":[{"text":"8 ounces dried wide rice noodles"},{"text":"1/4 cup fish sauce (nam pla)"},{"text":"3 tablespoons tamarind juice"},{"text":"2 tablespoons sugar"},{"text":"3 tablespoons peanut oil"},{"text":"1 1/2 pounds large shrimp, peeled with tails on"},{"text":"4 garlic cloves, finely chopped"},{"text":"2 shallots, sliced"},{"text":"1 fresh red chile, sliced"},{"text":"1 large egg, lightly beaten"},{"text":"1 cup fresh bean sprouts"},{"text":"1/2 cup chopped unsalted roasted peanuts"},{"text":"1 lime, cut into small wedges"},{"text":"1/4 cup fresh cilantro leaves"}],"cookTime":10,"steps":[{"text":"Soak the dried rice noodles in cool or lukewarm water for 30 minutes, or until they're limp but still firm to the touch; later cooking in the wok will soften them more. Drain the noodles thoroughly in a colander and set aside while preparing the other ingredients."},{"text":"In a small bowl, mix the fish sauce, tamarind juice, and sugar; stir well to melt the sugar. Taste and adjust flavors to the desired combination of salty, sour, and sweet."},{"text":"Heat a wok over medium-high heat until it is smoking hot. Add 1 tablespoon of the oil and quickly stir-fry the shrimp until they turn pink and are almost cooked through; 1 to 2 minutes. Remove the shrimp to a plate and cover to keep warm."},{"text":"Add the remaining oil to the wok and toss in the garlic, shallots, and chile; stir-fry for 30 seconds. Push the garlic and shallots to 1 side of the wok and pour the egg into the center. Scramble the egg lightly until set, breaking it up into pieces with a spatula. Add the drained noodles to the wok, stirring and tossing quickly with 2 spatulas to separate the strands. Pour in the fish sauce mixture, tossing well to coat the noodles and keep them from sticking (if the noodles are still too firm, drizzle with 1 to 2 tablespoons of water to help them cook.)"},{"text":"When the noodles are in good shape, toss in 1/2 of the bean sprouts and peanuts; save the remaining for garnish. Continue to stir-fry, to combine. Return the shrimp to the wok and toss the pad thai together to warm everything through. Serve the pad thai on a platter, pile the remaining bean sprouts and peanuts on 1 side of the dish and garnish with the lime wedges and cilantro. Squeeze lime juice over each portion before eating."}],"servings":"4 servings","id":"pad_thai","prepTime":40},{"name":"Fajitas","author":"Tyler Florence","ingredients":[{"text":"1 orange, juiced"},{"text":"2 limes, juiced"},{"text":"4 tablespoons olive oil"},{"text":"2 garlic cloves, roughly chopped"},{"text":"3 chipolte chiles, in adobo sauce"},{"text":"3 tablespoon roughly chopped fresh cilantro leaves"},{"text":"1 teaspoon ground cumin"},{"text":"1 teaspoon salt"},{"text":"2 1/4 pounds skirt or flank steak, trimmed of fat cut into thirds or 8-inch pieces"},{"text":"Salt and pepper"},{"text":"2 red bell peppers, thinly sliced"},{"text":"1 large onion, thinly sliced"},{"text":"Lime juice, olive oil, optional"},{"text":"12 flour tortillas, warm"},{"text":"Guacamole"},{"text":"Good quality store bought salsa"}],"cookTime":20,"inactiveTime":120,"servings":"6 to 8 servings","steps":[{"text":"In a small 2 cup measuring cup, or something similar size and shape, combine all the marinade ingredients. Using an immersion blender, puree the marinade until smooth. Transfer to a re-sealable plastic bag and add the steak, seal and shake to coat. Refrigerate the beef for 2 to 4 hours to tenderize and flavor the beef."},{"text":"Preheat a ridged grill pan on high heat."},{"text":"Drain the marinade from the beef. Lightly oil the grill or grill pan. Season liberally with salt and freshly ground black pepper. Grill the steak over medium-high heat and cook for 4 minutes on each side and then transfer to a cutting board and let rest. Depending on the size of your grill pan you may need to cook in batches."},{"text":"Once the beef is off the grill pan and resting, add the bell peppers and onions tossed with lime juice and olive oil, if using. Grill the mixture for 7 to 8 minutes until the vegetables are just barely limp."},{"text":"While the peppers and onions are cooking, heat up the tortillas. Turn any free burners on a medium low flame. Place a tortilla on each flame and let it char about 30 seconds to 1 minute, flip the tortilla and repeat on the second side. Once heated and charred remove the tortilla to a clean tea towel and wrap to keep warm. Repeat until you have warmed all of your tortillas."},{"text":"You can also heat your tortillas in a microwave, lightly dampen a tea towel with some water, wrap the tortillas in the damp towel and heat in the microwave for about 1 minute. Check to see if they are warm, if not repeat the heating at 1 minute intervals until they are warm and pliable."},{"text":"Thinly slice the steak against the grain on a diagonal."},{"text":"To serve, spread some guacamole on a tortilla, top with a few slices of steak, peppers and onions, and salsa. Roll up the tortilla to enclose the filling."},{"text":"May also be served with sour cream and shredded cheese."}],"id":"fajitas","prepTime":50},{"name":"Slow-Cooker Pork Tacos","author":"Food Network Kitchens","ingredients":[{"text":"3 whole ancho chiles"},{"text":"3 whole pasilla chiles"},{"text":"4 cloves garlic, unpeeled"},{"text":"2 to 3 chipotles in adobo sauce"},{"text":"1/2 medium white onion, roughly chopped"},{"text":"3 tablespoons extra-virgin olive oil"},{"text":"2 tablespoons honey"},{"text":"1 tablespoon cider vinegar"},{"text":"Kosher salt"},{"text":"2 teaspoons dried oregano, preferably Mexican"},{"text":"3 3/4 cups low-sodium chicken broth"},{"text":"4 pounds boneless pork shoulder (untrimmed), cut into chunks"},{"text":"Freshly ground pepper"},{"text":"2 bay leaves"},{"text":"1 cinnamon stick"},{"text":"Corn tortillas, warmed, for serving"},{"text":"Assorted taco toppings, for garnish"}],"cookTime":311,"steps":[{"text":"Put the ancho and pasilla chiles and the garlic in a bowl; add 2 to 3 tablespoons water. Microwave on high until soft and pliable, 2 to 3 minutes. Stem and seed the chiles; peel the garlic. Transfer the chiles and garlic to a blender."},{"text":"Add the chipotles, onion, 2 tablespoons olive oil, honey, vinegar, 1 tablespoon salt and the oregano to the blender; puree until smooth. Heat the remaining 1 tablespoon oil in a large skillet over high heat; add the chile sauce and fry, stirring, until thick and fragrant, about 8 minutes. Pour in the broth and reduce until slightly thickened."},{"text":"Season the pork all over with salt and pepper and transfer to a large slow cooker. Add the bay leaves and cinnamon stick, then pour in the sauce. Cover and cook on high until the meat is tender, about 5 hours. (Or cook the meat in a large Dutch oven, covered, for 1 hour 45 minutes at 350 degrees; uncover and cook 30 more minutesd.)"},{"text":"Discard the bay leaves and cinnamon stick. Shred the pork with 2 forks; season with salt and pepper. Serve the shredded pork in the tortillas, along with toppings."}],"id":"slowcooker_pork_tacos","prepTime":25},{"name":"Salisbury Steak","ingredients":[{"text":"6 ounces minced onion"},{"text":"1 ounce minced garlic"},{"text":"3 tablespoons butter"},{"text":"2 pounds ground beef"},{"text":"4 eggs"},{"text":"8 ounces bread crumbs"},{"text":"4 ounces chopped flat leaf parsley"},{"text":"12 ounces cooked and diced button mushrooms"},{"text":"2 ounces butter"},{"text":"2 ounces flour"},{"text":"24 ounces veal stock"},{"text":"1 pound sliced button mushrooms"},{"text":"2 red onions, sliced 1/2-inch thick, grilled"}],"author":"Random","cookTime":110,"steps":[{"text":"Saute onions, and garlic in 1 tablespoon butter until translucent and set aside to cool. Mix beef with cooled onion mixture, eggs, bread crumbs, parsley, and mushrooms. Form into 4-ounce patties and saute in the remaining 2 tablespoons of butter until golden brown on both sides and set aside."},{"text":"In saucepan melt 2 ounces of butter and add flour and cook over low heat for 1 minute until wet sand consistency. Begin to add stock 1/3 at a time whisking and bringing to simmer each time making sure there are no lumps. Add mushrooms and simmer for 1/2 hour. Place patties in a roasting pan and pour gravy over patties and bake in a preheated 375 degree oven for 45 minutes. Garnish with grilled onions and serve."}],"servings":"12 servings","id":"salisbury_steak","prepTime":10},{"name":"Buffalo Chicken Sub","author":"Jeff Mauro","ingredients":[{"text":"1 tablespoon vegetable oil"},{"text":"2 pounds boneless, skinless chicken thighs"},{"text":"Salt and ground black pepper"},{"text":"1 tablespoon dark brown sugar"},{"text":"2 teaspoons paprika"},{"text":"1/4 teaspoon cayenne"},{"text":"1 cup your favorite wing sauce, such as Frank's RedHot"},{"text":"2 medium carrots, diced"},{"text":"2 celery ribs, diced"},{"text":"2 tomatoes, seeded and diced"},{"text":"4 hoagie rolls"},{"text":"1 cup blue cheese crumbles"},{"text":"Homemade Ranch Dressing"}],"cookTime":10,"steps":[{"text":"Preheat the oven to 425 degrees F."},{"text":"Heat a 12-inch skillet over medium-high heat. Add the vegetable oil. Sprinkle both sides of the chicken with some salt and pepper, the brown sugar, paprika and cayenne. Sear both sides of the chicken in the skillet until golden, about 4 minutes. Add in the wing sauce, bring to a simmer and finish off in the oven until the chicken registers 160 degrees F on an instant-read thermometer. Let cool, and then pull the meat with your hands. Adjust the seasoning if necessary and place back in the oven at BROIL until crusty and caramelized on top, about 4 minutes."},{"text":"In a bowl, the combine carrots, celery and tomatoes, and season with salt and pepper. Mix until combined."},{"text":"Cut the hoagie rolls horizontally. Place an even layer of blue cheese crumbles on the bottom, then the chicken and then the veggies. Serve with a side of Homemade Ranch Dressing."}],"servings":"4 sandwiches","id":"buffalo_chicken_sub","prepTime":15},{"name":"Braciole","ingredients":[{"text":"1/2 cup dried Italian-style bread crumbs"},{"text":"1 garlic clove, minced"},{"text":"2/3 cup grated Pecorino Romano"},{"text":"1/3 cup grated provolone"},{"text":"2 tablespoons chopped fresh Italian parsley leaves"},{"text":"4 tablespoons olive oil"},{"text":"Salt and freshly ground black pepper"},{"text":"1 (1 1/2-pound) flank steak, pounded to 1/4 to 1/2 inch thick"},{"text":"1 cup dry white wine"},{"text":"3 1/4 cups Simple Tomato Sauce, recipe follows, or store-bought marinara sauce"},{"text":"1/2 cup extra-virgin olive oil"},{"text":"1 small onion, chopped"},{"text":"2 cloves garlic, chopped"},{"text":"1 stalk celery, chopped"},{"text":"1 carrot, chopped"},{"text":"2 (32-ounce) cans crushed tomatoes"},{"text":"4 to 6 basil leaves"},{"text":"2 dried bay leaves"},{"text":"Sea salt and freshly ground black pepper"},{"text":"4 tablespoons unsalted butter, optional"}],"author":"Giada de Laurentiis","cookTime":105,"steps":[{"text":"Stir the first 5 ingredients in a medium bowl to blend. Stir in 2 tablespoons of the oil. Season mixture with salt and pepper and set aside."},{"text":"Lay the flank steak flat on the work surface. Sprinkle the bread crumb mixture evenly over the steak to cover the top evenly. Starting at 1 short end, roll up the steak as for a jelly roll to enclose the filling completely. Using butcher's twine, tie the steak roll to secure. Sprinkle the braciole with salt and pepper."},{"text":"Preheat the oven to 350 degrees F."},{"text":"Heat the remaining 2 tablespoons of oil in a heavy large ovenproof skillet over medium heat. Add the braciole and cook until browned on all sides, about 8 minutes. Add the wine to the pan and bring to a boil. Stir in the marinara sauce. Cover partially with foil and bake until the meat is almost tender, turning the braciole and basting with the sauce every 30 minutes. After 1 hour, uncover and continue baking until the meat is tender, about 30 minutes longer. The total cooking time should be about 1 1/2 hours."},{"text":"Remove the braciole from the sauce. Using a large sharp knife, cut the braciole crosswise and diagonally into 1/2-inch-thick slices. Transfer the slices to plates. Spoon the sauce over and serve."},{"text":"Tomato sauce recipe:"},{"text":"In a large casserole pot, heat oil over medium-high heat. Add onion and garlic and saute until soft and translucent, about 2 minutes. Add celery and carrot and season with salt and pepper. Saute until all the vegetables are soft, about 5 minutes. Add tomatoes, basil, and bay leaves and reduce the heat to low. Cover the pot and simmer for 1 hour or until thick. Remove bay leaves and taste for seasoning. If sauce tastes too acidic, add unsalted butter, 1 tablespoon at a time, to round out the flavor."},{"text":"Pour half the tomato sauce into the bowl of a food processor. Process until smooth. Continue with remaining tomato sauce."},{"text":"If not using all the sauce, allow it to cool completely and then pour 1 to 2 cup portions into plastic freezer bags. Freeze for up to 6 months."}],"servings":"4 servings","id":"braciole","prepTime":25},{"name":"Chicken Cacciatore","author":"Giada De Laurentiis","ingredients":[{"text":"4 chicken thighs, on the bone, skin removed"},{"text":"2 chicken breasts, boneless and skinless"},{"text":"2 teaspoons salt, plus more to taste"},{"text":"1 teaspoon freshly ground black pepper, plus more to taste"},{"text":"1/2 cup all purpose flour, for dredging"},{"text":"3 tablespoons olive oil"},{"text":"1 large red bell pepper, chopped"},{"text":"1 onion, chopped"},{"text":"3 garlic cloves, finely chopped"},{"text":"3/4 cup dry white wine"},{"text":"1 ( 28-ounce) can diced tomatoes with juice"},{"text":"3/4 cup reduced-sodium chicken broth"},{"text":"3 tablespoons drained capers"},{"text":"3/4 teaspoon dried oregano leaves"},{"text":"1/4 cup coarsely chopped fresh basil leaves"}],"cookTime":40,"steps":[{"text":"Sprinkle the chicken pieces with 1 teaspoon of each salt and pepper. Dredge the chicken pieces in the flour to coat lightly."},{"text":"In a large heavy saute pan, heat the oil over a medium-high flame. Add the chicken pieces to the pan and saute just until brown, about 5 minutes per side. If all the chicken does not fit in the pan, saute it in 2 batches. Transfer the chicken to a plate and set aside. Add the bell pepper, onion and garlic to the same pan and saute over medium heat until the onion is tender, about 5 minutes. Season with salt and pepper. Add the wine and simmer until reduced by half, about 3 minutes. Add the tomatoes with their juice, broth, capers and oregano. Return the chicken pieces to the pan and turn them to coat in the sauce. Bring the sauce to a simmer. Continue simmering over medium-low heat until the chicken is just cooked through, about 30 minutes for the breast pieces, and 20 minutes for the thighs."},{"text":"Using tongs, transfer the chicken to a platter. If necessary, boil the sauce until it thickens slightly, about 3 minutes. Spoon off any excess fat from atop the sauce. Spoon the sauce over the chicken, then sprinkle with the basil and serve."}],"servings":"4 servings","id":"chicken_cacciatore","prepTime":15},{"author":"Melissa Laughlin","steps":[],"id":"mac_and_cheese","name":"Mac and Cheese","ingredients":[{"text":"4 tablespoons butter"},{"text":"1/4 cup flour"},{"text":"2 1/2 cups whole milk"},{"text":"1 teaspoon dry mustard"},{"text":"1 lb white cheddar, aged 6 months (Wegman's brand)"},{"text":"1 lb mini shells"}]},{"name":"Homemade Ranch Dressing","ingredients":[{"text":"1 1/2 cups mayonnaise"},{"text":"1/2 cup buttermilk"},{"text":"1 teaspoon granulated garlic"},{"text":"1 teaspoons fresh dill, minced"},{"text":"1/2 teaspoon honey or agave syrup"},{"text":"1/3 teaspoon salt"},{"text":"1/4 teaspoon Dijon mustard"},{"text":"1/8 teaspoon ground black pepper"}],"author":"Jeff Mauro","steps":[{"text":"Mix the mayonnaise, buttermilk, garlic, dill, honey, salt, mustard and pepper in a bowl. Store in an airtight container."}],"servings":"2 cups","id":"homemade_ranch_dressing","prepTime":5},{"name":"Smoked Pork Brine","author":"Alton Brown","ingredients":[{"text":"1 1/2 cup molasses"},{"text":"1 cup Kosher salt"},{"text":"1 gallon filtered water"}],"inactiveTime":400,"steps":[{"text":"Combine all ingredients in a large container, and put the pork in.  Leave the pork in the brine for 8 to 12 hours."},{"text":"This recipe is for one pack of pork butt from Costco (two 8-pound butts)."}],"id":"smoked_pork_brine","prepTime":10},{"name":"Barbecued Ribs","author":"allrecipes","ingredients":[{"text":"one pack of Babyback ribs from Costco"},{"text":"2/3 cup water"},{"text":"1/3 cup red wine vinegar"},{"text":"barbecue sauce for basting"}],"cookTime":120,"steps":[{"text":"Preheat over to 300 degrees."},{"text":"Place the ribs on a rack on a hotel pan.  Combine the red wine and vinegar, and pour over the ribs.  Cook for 90 minutes, and leave in the oven until the grill is ready."},{"text":"Turn the grill on to medium high heat.  Baste the ribs with some of the barbecue sauce, then place on the grill.  Cook for about 8 minutes, flip, and baste the other side.  The goal is to get some nice color and bark on the ribs."}],"inactiveTime":15,"id":"barbecued_ribs","prepTime":10},{"name":"Mustard Rub","ingredients":[{"text":"1/3 cup vegetable oil"},{"text":"4 teaspoons dijon mustard"},{"text":"3 teaspoons sugar"},{"text":"2 teaspoons red wine vinegar"},{"text":"1 teaspoon dry mustard"},{"text":"2 teaspoons fresh sage, chopped"},{"text":"6 to 8 pound pork butt, brined"}],"author":"Bradley Smokers","steps":[{"text":"Combine all ingredients, and rub generously on pork butt."}],"id":"mustard_rub","prepTime":5},{"name":"Jabes Sauce","author":"allrecipes.com","ingredients":[{"text":"1 cup ketchup"},{"text":"1/2 cup cider vinegar"},{"text":"1/3 cup Worchestershire sauce"},{"text":"1/4 cup prepared mustard"},{"text":"2 tablespoons butter"},{"text":"1/2 cup packed brown sugar"},{"text":"1 teaspoon hot pepper sauce"},{"text":"1/8 teaspoon salt"}],"cookTime":60,"steps":[{"text":"Combine all ingredients in a pot, and bring to a boil.  Reduce heat, and simmer for an hour."}],"id":"jabes_sauce","prepTime":20},{"name":"North Carolina BBQ Sauce","ingredients":[{"text":"2 cups apple cider vinegar"},{"text":"2 tablespoons dark brown sugar"},{"text":"1 tablespoon ketchup"},{"text":"1 tablespoon hot sauce"},{"text":"1 teaspoon red pepper flakes"},{"text":"1 teaspoon ground black pepper"},{"text":"1 teaspoon Kosher salt"}],"author":"Melissa Laughlin","cookTime":5,"inactiveTime":60,"servings":"2 cups","steps":[{"text":"Place all of the ingredients in a small, non-reactive sauce pan and bring to a boil. Whisk until the sugar and salt is completely dissolved, remove from heat, and allow to cool to room temperature."},{"text":"Pour the sauce into a jar or squeeze bottle and let rest in the refrigerator one day before using."}],"id":"north_carolina_bbq_sauce","prepTime":5}]