[{"description": "Nothing is better than toast", "ingredients": [{"text": "2 slices of bread", "id": 1}, {"text": "2 tbsp butter", "id": 1}], "cookTime": 5, "steps": [{"text": "If the bread is not already sliced, slice it.", "id": 0}, {"text": "Place in toaster until golden brown.", "id": 1}, {"text": "Remove from toaster, and apply butter.", "id": 2}], "id": 0, "prepTime": 3, "name": "Toast"}, {"description": "A simple grilled cheese sandwich", "ingredients": [{"text": "4 oz. gruyere cheese, sliced"}, {"text": "4 oz. fontina cheese, sliced"}, {"text": "2 oz. blue cheese, crumbled"}, {"text": "3 tbsp. butter"}, {"text": "2 slices of bread"}], "cookTime": 10, "steps": [{"text": "Begin by placing a pan on the stove, leaving the heat off."}, {"text": "Butter the side of the bread that is going to be the outside of the sandwich, for both slices.  Place the first slice butter side down in the pan."}, {"text": "Layer the cheese on the bread in the pan.  When finished, place the other piece of bread on the sandwich, butter side up, and turn on the heat.  Cook until both sides are golden brown, then eat."}], "id": 1, "prepTime": 5, "name": "Grilled Cheese"}, {"description": "An easy-to-make, no cook hollandaise.", "ingredients": [{"text": "1 to 1 1/2 sticks butter"}, {"text": "2 egg yolks"}, {"text": "1 teaspoon water"}, {"text": "1 teaspoon lemon juice"}, {"text": "Salt and pepper to taste"}], "cookTime": 0, "steps": [{"text": "In a blender blend yolks, water and lemon juice until smooth. Add melted butter by droplets until sauce begins to emulsify. Then continue slowly adding hot butter by spoonfuls. Strain sauce and season."}, {"text": "Serve over poached eggs on toast points"}], "id": 2, "name": "Blender Hollandaise Sauce"}, {"description": "Courtesy of Ina Garten", "ingredients": [{"text": "3 split chicken breasts, bone-in, skin-on"}, {"text": "3 tablespoons olive oil"}, {"text": "Kosher salt"}, {"text": "Freshly ground black pepper"}, {"text": "5 cups chicken stock, preferably homemade"}, {"text": "2 chicken bouillon cubes"}, {"text": "6 tablespoons (1 1/2 sticks) unsalted butter"}, {"text": "2 cups yellow onions, chopped (2 onions)"}, {"text": "3/4 cup all-purpose flour"}, {"text": "1/4 cup heavy cream"}, {"text": "2 cups medium-diced carrots, blanched for 2 minutes"}, {"text": "1 (10-ounce) package frozen peas (2 cups)"}, {"text": "1 1/2 cups frozen small whole onions"}, {"text": "1/2 cup minced fresh parsley leaves"}, {"text": "3 stalks celery"}, {"text": "7 oz crimini mushrooms"}, {"text": "3 cups all-purpose flour"}, {"text": "1 1/2 teaspoons kosher salt"}, {"text": "1 teaspoon baking powder"}, {"text": "1/2 cup vegetable shortening"}, {"text": "1/4 pound cold unsalted butter, diced"}, {"text": "1/2 to 2/3 cup ice water"}, {"text": "1 egg beaten with 1 tablespoon water, for egg wash"}, {"text": "Flaked sea salt and cracked black pepper"}], "cookTime": 55, "steps": [{"text": "Preheat the oven to 350 degrees F."}, {"text": "Place the chicken breasts on a baking sheet and rub them with olive oil. Sprinkle generously with salt and pepper. Roast for 35 to 40 minutes, or until cooked through. Set aside until cool enough to handle, then remove the meat from the bones and discard the skin. Cut the chicken into large dice. You will have 4 to 6 cups of cubed chicken."}, {"text": "In a saute pan, heat olive oil over medium heat.  Add pearl onion, salt, and pepper.  Saute until caramelized, deglazing with chicken stock if pan gets too hot.  Deglaze with marsala.  Add diced mushrooms, salt, and pepper, and saute until caramelized.  Deglaze with more marsala. In a large pot or Dutch oven, melt the butter and saute the onions, celery, and carrots (with salt and pepper) over medium-low heat for 10 to 15 minutes, until translucent. Add the flour and cook over low heat, stirring constantly, for 2 minutes. Add the hot chicken stock to the sauce. Simmer over low heat for 1 more minute, stirring, until thick. Add 2 teaspoons salt, 1/2 teaspoon pepper, and heavy cream. Add the cubed chicken, carrots, peas, onions, mushrooms and parsley. Mix well."}, {"text": "For the pastry, mix the flour, salt, and baking powder in the bowl of a food processor fitted with a metal blade. Add the shortening and butter and mix quickly with your fingers until each piece is coated with flour. Pulse 10 times, or until the fat is the size of peas. With the motor running, add the ice water; process only enough to moisten the dough and have it just come together. Dump the dough out onto a floured board and knead quickly into a ball. Wrap the dough in plastic and allow it to rest in the refrigerator for 30 minutes."}, {"text": "Preheat the oven to 375 degrees F."}, {"text": "Divide the filling equally among 4 ovenproof bowls. Divide the dough into quarters and roll each piece into an 8-inch circle. Brush the outside edges of each bowl with the egg wash, then place the dough on top. Trim the circle to 1/2-inch larger than the top of the bowl. Crimp the dough to fold over the side, pressing it to make it stick. Brush the dough with egg wash and make 3 slits in the top. Sprinkle with sea salt and cracked pepper. Place on a baking sheet and bake for 1 hour, or until the top is golden brown and the filling is bubbling hot."}], "id": 3, "prepTime": 30, "name": "Chicken Pot Pie"}, {"description": "Courtesy of Melissa Laughlin", "ingredients": [{"text": "1/2 to 3/4 cup mayonaisse"}, {"text": "1 dill pickle spear, minced"}, {"text": "1 tsp hot sauce"}, {"text": "1/2 tsp Worchestershire sauce"}, {"text": "1 tsp Amish mustard"}, {"text": "Salt and pepper to taste"}], "cookTime": 0, "steps": [{"text": "Combine all ingredients in a container, and chill.  The longer it sits, the better it gets."}], "id": 4, "prepTime": 10, "name": "Tartar Sauce"}, {"description": "Courtesy of Michele Laughlin", "ingredients": [{"text": "1 medium onion, diced"}, {"text": "1 lb broccoli crowns, chopped"}, {"text": "1 carrot, chopped"}, {"text": "1 tablespoon olive oil"}, {"text": "4 cups chicken broth"}, {"text": "2 tbps fat-free half & half"}, {"text": "1 tablespoon butter"}, {"text": "1 tsp salt"}, {"text": "Pinch of red pepper flakes"}, {"text": "Pinch of celery salt"}, {"text": "Salt and pepper to taste"}], "steps": [{"text": "Note: this recipe was typed from an email, so the amounts are not exact."}, {"text": "In a large soup pot, combine olive oil and butter, and bring up to a medium heat.  Saute onions, red pepper flakes, and celery salt. After a couple of minutes, add in the carrot and cook together for about 5 minutes."}, {"text": "Add the broccoli to the pot, along with the salt, and cook for 5 minutes.  Add in enough chicken broth to just barely cover the vegetables.  Stir, and bring to a boil, then reduce to a simmer.  Cook until the broccoli is tender (about 5 to 10 minutes)"}, {"text": "Use a stick blender and blend until soup is smooth.  Add in the half & half, and stiir until combined.  Add salt and pepper to taste."}], "id": 5, "prepTime": 40, "name": "Broccoli Soup"}]